export interface NatdssB04MedicalRecordFrontSheetNonTcmSupplementVO {
  /**
   * 患者ID
   */
  patientId: string | number;

  /**
   * 单次就诊唯一标识号
   */
  visitSn: string;

  /**
   * 其他手术操作编码1
   */
  c35x01c: string;

  /**
   * 其他手术操作名称1
   */
  c36x01n: string;

  /**
   * 其他手术操作日期1
   */
  c37x01: string;

  /**
   * 其他手术操作级别1
   */
  c38x01: string;

  /**
   * 其他手术操作术者1
   */
  c39x01: string;

  /**
   * 其他手术操作Ⅰ助1
   */
  c40x01: string;

  /**
   * 其他手术操作Ⅱ助1
   */
  c41x01: string;

  /**
   * 其他手术操作切口愈合等级1
   */
  c42x01c: string;

  /**
   * 其他手术操作麻醉方式1
   */
  c43x01c: string;

  /**
   * 其他手术操作麻醉医师1
   */
  c44x01: string;

  /**
   * 其他手术操作编码2
   */
  c35x02c: string;

  /**
   * 其他手术操作名称2
   */
  c36x02n: string;

  /**
   * 其他手术操作日期2
   */
  c37x02: string;

  /**
   * 其他手术操作级别2
   */
  c38x02: string;

  /**
   * 其他手术操作术者2
   */
  c39x02: string;

  /**
   * 其他手术操作Ⅰ助2
   */
  c40x02: string;

  /**
   * 其他手术操作Ⅱ助2
   */
  c41x02: string;

  /**
   * 其他手术操作切口愈合等级2
   */
  c42x02c: string;

  /**
   * 其他手术操作麻醉方式2
   */
  c43x02c: string;

  /**
   * 其他手术操作麻醉医师2
   */
  c44x02: string;

  /**
   * 其他手术操作编码3
   */
  c35x03c: string;

  /**
   * 其他手术操作名称3
   */
  c36x03n: string;

  /**
   * 其他手术操作日期3
   */
  c37x03: string;

  /**
   * 其他手术操作级别3
   */
  c38x03: string;

  /**
   * 其他手术操作术者3
   */
  c39x03: string;

  /**
   * 其他手术操作Ⅰ助3
   */
  c40x03: string;

  /**
   * 其他手术操作Ⅱ助3
   */
  c41x03: string;

  /**
   * 其他手术操作切口愈合等级3
   */
  c42x03c: string;

  /**
   * 其他手术操作麻醉方式3
   */
  c43x03c: string;

  /**
   * 其他手术操作麻醉医师3
   */
  c44x03: string;

  /**
   * 其他手术操作编码4
   */
  c35x04c: string;

  /**
   * 其他手术操作名称4
   */
  c36x04n: string;

  /**
   * 其他手术操作日期4
   */
  c37x04: string;

  /**
   * 其他手术操作级别4
   */
  c38x04: string;

  /**
   * 其他手术操作术者4
   */
  c39x04: string;

  /**
   * 其他手术操作Ⅰ助4
   */
  c40x04: string;

  /**
   * 其他手术操作Ⅱ助4
   */
  c41x04: string;

  /**
   * 其他手术操作切口愈合等级4
   */
  c42x04c: string;

  /**
   * 其他手术操作麻醉方式4
   */
  c43x04c: string;

  /**
   * 其他手术操作麻醉医师4
   */
  c44x04: string;

  /**
   * 其他手术操作编码5
   */
  c35x05c: string;

  /**
   * 其他手术操作名称5
   */
  c36x05n: string;

  /**
   * 其他手术操作日期5
   */
  c37x05: string;

  /**
   * 其他手术操作级别5
   */
  c38x05: string;

  /**
   * 其他手术操作术者5
   */
  c39x05: string;

  /**
   * 其他手术操作Ⅰ助5
   */
  c40x05: string;

  /**
   * 其他手术操作Ⅱ助5
   */
  c41x05: string;

  /**
   * 其他手术操作切口愈合等级5
   */
  c42x05c: string;

  /**
   * 其他手术操作麻醉方式5
   */
  c43x05c: string;

  /**
   * 其他手术操作麻醉医师5
   */
  c44x05: string;

  /**
   * 其他手术操作编码6
   */
  c35x06c: string;

  /**
   * 其他手术操作名称6
   */
  c36x06n: string;

  /**
   * 其他手术操作日期6
   */
  c37x06: string;

  /**
   * 其他手术操作级别6
   */
  c38x06: string;

  /**
   * 其他手术操作术者6
   */
  c39x06: string;

  /**
   * 其他手术操作Ⅰ助6
   */
  c40x06: string;

  /**
   * 其他手术操作Ⅱ助6
   */
  c41x06: string;

  /**
   * 其他手术操作切口愈合等级6
   */
  c42x06c: string;

  /**
   * 其他手术操作麻醉方式6
   */
  c43x06c: string;

  /**
   * 其他手术操作麻醉医师6
   */
  c44x06: string;

  /**
   * 其他手术操作编码7
   */
  c35x07c: string;

  /**
   * 其他手术操作名称7
   */
  c36x07n: string;

  /**
   * 其他手术操作日期7
   */
  c37x07: string;

  /**
   * 其他手术操作级别7
   */
  c38x07: string;

  /**
   * 其他手术操作术者7
   */
  c39x07: string;

  /**
   * 其他手术操作Ⅰ助7
   */
  c40x07: string;

  /**
   * 其他手术操作Ⅱ助7
   */
  c41x07: string;

  /**
   * 其他手术操作切口愈合等级7
   */
  c42x07c: string;

  /**
   * 其他手术操作麻醉方式7
   */
  c43x07c: string;

  /**
   * 其他手术操作麻醉医师7
   */
  c44x07: string;

  /**
   * 其他手术操作编码8
   */
  c35x08c: string;

  /**
   * 其他手术操作名称8
   */
  c36x08n: string;

  /**
   * 其他手术操作日期8
   */
  c37x08: string;

  /**
   * 其他手术操作级别8
   */
  c38x08: string;

  /**
   * 其他手术操作术者8
   */
  c39x08: string;

  /**
   * 其他手术操作Ⅰ助8
   */
  c40x08: string;

  /**
   * 其他手术操作Ⅱ助8
   */
  c41x08: string;

  /**
   * 其他手术操作切口愈合等级8
   */
  c42x08c: string;

  /**
   * 其他手术操作麻醉方式8
   */
  c43x08c: string;

  /**
   * 其他手术操作麻醉医师8
   */
  c44x08: string;

  /**
   * 其他手术操作编码9
   */
  c35x09c: string;

  /**
   * 其他手术操作名称9
   */
  c36x09n: string;

  /**
   * 其他手术操作日期9
   */
  c37x09: string;

  /**
   * 其他手术操作级别9
   */
  c38x09: string;

  /**
   * 其他手术操作术者9
   */
  c39x09: string;

  /**
   * 其他手术操作Ⅰ助9
   */
  c40x09: string;

  /**
   * 其他手术操作Ⅱ助9
   */
  c41x09: string;

  /**
   * 其他手术操作切口愈合等级9
   */
  c42x09c: string;

  /**
   * 其他手术操作麻醉方式9
   */
  c43x09c: string;

  /**
   * 其他手术操作麻醉医师9
   */
  c44x09: string;

  /**
   * 其他手术操作编码10
   */
  c35x10c: string;

  /**
   * 其他手术操作名称10
   */
  c36x10n: string;

  /**
   * 其他手术操作日期10
   */
  c37x10: string;

  /**
   * 其他手术操作级别10
   */
  c38x10: string;

  /**
   * 其他手术操作术者10
   */
  c39x10: string;

  /**
   * 其他手术操作Ⅰ助10
   */
  c40x10: string;

  /**
   * 其他手术操作Ⅱ助10
   */
  c41x10: string;

  /**
   * 其他手术操作切口愈合等级10
   */
  c42x10c: string;

  /**
   * 其他手术操作麻醉方式10
   */
  c43x10c: string;

  /**
   * 其他手术操作麻醉医师10
   */
  c44x10: string;

  /**
   * 其他手术操作编码11
   */
  c35x11c: string;

  /**
   * 其他手术操作名称11
   */
  c36x11n: string;

  /**
   * 其他手术操作日期11
   */
  c37x11: string;

  /**
   * 其他手术操作级别11
   */
  c38x11: string;

  /**
   * 其他手术操作术者11
   */
  c39x11: string;

  /**
   * 其他手术操作Ⅰ助11
   */
  c40x11: string;

  /**
   * 其他手术操作Ⅱ助11
   */
  c41x11: string;

  /**
   * 其他手术操作切口愈合等级11
   */
  c42x11c: string;

  /**
   * 其他手术操作麻醉方式11
   */
  c43x11c: string;

  /**
   * 其他手术操作麻醉医师11
   */
  c44x11: string;

  /**
   * 其他手术操作编码12
   */
  c35x12c: string;

  /**
   * 其他手术操作名称12
   */
  c36x12n: string;

  /**
   * 其他手术操作日期12
   */
  c37x12: string;

  /**
   * 其他手术操作级别12
   */
  c38x12: string;

  /**
   * 其他手术操作术者12
   */
  c39x12: string;

  /**
   * 其他手术操作Ⅰ助12
   */
  c40x12: string;

  /**
   * 其他手术操作Ⅱ助12
   */
  c41x12: string;

  /**
   * 其他手术操作切口愈合等级12
   */
  c42x12c: string;

  /**
   * 其他手术操作麻醉方式12
   */
  c43x12c: string;

  /**
   * 其他手术操作麻醉医师12
   */
  c44x12: string;

  /**
   * 其他手术操作编码13
   */
  c35x13c: string;

  /**
   * 其他手术操作名称13
   */
  c36x13n: string;

  /**
   * 其他手术操作日期13
   */
  c37x13: string;

  /**
   * 其他手术操作级别13
   */
  c38x13: string;

  /**
   * 其他手术操作术者13
   */
  c39x13: string;

  /**
   * 其他手术操作Ⅰ助13
   */
  c40x13: string;

  /**
   * 其他手术操作Ⅱ助13
   */
  c41x13: string;

  /**
   * 其他手术操作切口愈合等级13
   */
  c42x13c: string;

  /**
   * 其他手术操作麻醉方式13
   */
  c43x13c: string;

  /**
   * 其他手术操作麻醉医师13
   */
  c44x13: string;

  /**
   * 其他手术操作编码14
   */
  c35x14c: string;

  /**
   * 其他手术操作名称14
   */
  c36x14n: string;

  /**
   * 其他手术操作日期14
   */
  c37x14: string;

  /**
   * 其他手术操作级别14
   */
  c38x14: string;

  /**
   * 其他手术操作术者14
   */
  c39x14: string;

  /**
   * 其他手术操作Ⅰ助14
   */
  c40x14: string;

  /**
   * 其他手术操作Ⅱ助14
   */
  c41x14: string;

  /**
   * 其他手术操作切口愈合等级14
   */
  c42x14c: string;

  /**
   * 其他手术操作麻醉方式14
   */
  c43x14c: string;

  /**
   * 其他手术操作麻醉医师14
   */
  c44x14: string;

  /**
   * 其他手术操作编码15
   */
  c35x15c: string;

  /**
   * 其他手术操作名称15
   */
  c36x15n: string;

  /**
   * 其他手术操作日期15
   */
  c37x15: string;

  /**
   * 其他手术操作级别15
   */
  c38x15: string;

  /**
   * 其他手术操作术者15
   */
  c39x15: string;

  /**
   * 其他手术操作Ⅰ助15
   */
  c40x15: string;

  /**
   * 其他手术操作Ⅱ助15
   */
  c41x15: string;

  /**
   * 其他手术操作切口愈合等级15
   */
  c42x15c: string;

  /**
   * 其他手术操作麻醉方式15
   */
  c43x15c: string;

  /**
   * 其他手术操作麻醉医师15
   */
  c44x15: string;

  /**
   * 其他手术操作编码16
   */
  c35x16c: string;

  /**
   * 其他手术操作名称16
   */
  c36x16n: string;

  /**
   * 其他手术操作日期16
   */
  c37x16: string;

  /**
   * 其他手术操作级别16
   */
  c38x16: string;

  /**
   * 其他手术操作术者16
   */
  c39x16: string;

  /**
   * 其他手术操作Ⅰ助16
   */
  c40x16: string;

  /**
   * 其他手术操作Ⅱ助16
   */
  c41x16: string;

  /**
   * 其他手术操作切口愈合等级16
   */
  c42x16c: string;

  /**
   * 其他手术操作麻醉方式16
   */
  c43x16c: string;

  /**
   * 其他手术操作麻醉医师16
   */
  c44x16: string;

  /**
   * 其他手术操作编码17
   */
  c35x17c: string;

  /**
   * 其他手术操作名称17
   */
  c36x17n: string;

  /**
   * 其他手术操作日期17
   */
  c37x17: string;

  /**
   * 其他手术操作级别17
   */
  c38x17: string;

  /**
   * 其他手术操作术者17
   */
  c39x17: string;

  /**
   * 其他手术操作Ⅰ助17
   */
  c40x17: string;

  /**
   * 其他手术操作Ⅱ助17
   */
  c41x17: string;

  /**
   * 其他手术操作切口愈合等级17
   */
  c42x17c: string;

  /**
   * 其他手术操作麻醉方式17
   */
  c43x17c: string;

  /**
   * 其他手术操作麻醉医师17
   */
  c44x17: string;

  /**
   * 其他手术操作编码18
   */
  c35x18c: string;

  /**
   * 其他手术操作名称18
   */
  c36x18n: string;

  /**
   * 其他手术操作日期18
   */
  c37x18: string;

  /**
   * 其他手术操作级别18
   */
  c38x18: string;

  /**
   * 其他手术操作术者18
   */
  c39x18: string;

  /**
   * 其他手术操作Ⅰ助18
   */
  c40x18: string;

  /**
   * 其他手术操作Ⅱ助18
   */
  c41x18: string;

  /**
   * 其他手术操作切口愈合等级18
   */
  c42x18c: string;

  /**
   * 其他手术操作麻醉方式18
   */
  c43x18c: string;

  /**
   * 其他手术操作麻醉医师18
   */
  c44x18: string;

  /**
   * 其他手术操作编码19
   */
  c35x19c: string;

  /**
   * 其他手术操作名称19
   */
  c36x19n: string;

  /**
   * 其他手术操作日期19
   */
  c37x19: string;

  /**
   * 其他手术操作级别19
   */
  c38x19: string;

  /**
   * 其他手术操作术者19
   */
  c39x19: string;

  /**
   * 其他手术操作Ⅰ助19
   */
  c40x19: string;

  /**
   * 其他手术操作Ⅱ助19
   */
  c41x19: string;

  /**
   * 其他手术操作切口愈合等级19
   */
  c42x19c: string;

  /**
   * 其他手术操作麻醉方式19
   */
  c43x19c: string;

  /**
   * 其他手术操作麻醉医师19
   */
  c44x19: string;

  /**
   * 其他手术操作编码20
   */
  c35x20c: string;

  /**
   * 其他手术操作名称20
   */
  c36x20n: string;

  /**
   * 其他手术操作日期20
   */
  c37x20: string;

  /**
   * 其他手术操作级别20
   */
  c38x20: string;

  /**
   * 其他手术操作术者20
   */
  c39x20: string;

  /**
   * 其他手术操作Ⅰ助20
   */
  c40x20: string;

  /**
   * 其他手术操作Ⅱ助20
   */
  c41x20: string;

  /**
   * 其他手术操作切口愈合等级20
   */
  c42x20c: string;

  /**
   * 其他手术操作麻醉方式20
   */
  c43x20c: string;

  /**
   * 其他手术操作麻醉医师20
   */
  c44x20: string;

  /**
   * 其他手术操作编码21
   */
  c35x21c: string;

  /**
   * 其他手术操作名称21
   */
  c36x21n: string;

  /**
   * 其他手术操作日期21
   */
  c37x21: string;

  /**
   * 其他手术操作级别21
   */
  c38x21: string;

  /**
   * 其他手术操作术者21
   */
  c39x21: string;

  /**
   * 其他手术操作Ⅰ助21
   */
  c40x21: string;

  /**
   * 其他手术操作Ⅱ助21
   */
  c41x21: string;

  /**
   * 其他手术操作切口愈合等级21
   */
  c42x21c: string;

  /**
   * 其他手术操作麻醉方式21
   */
  c43x21c: string;

  /**
   * 其他手术操作麻醉医师21
   */
  c44x21: string;

  /**
   * 其他手术操作编码22
   */
  c35x22c: string;

  /**
   * 其他手术操作名称22
   */
  c36x22n: string;

  /**
   * 其他手术操作日期22
   */
  c37x22: string;

  /**
   * 其他手术操作级别22
   */
  c38x22: string;

  /**
   * 其他手术操作术者22
   */
  c39x22: string;

  /**
   * 其他手术操作Ⅰ助22
   */
  c40x22: string;

  /**
   * 其他手术操作Ⅱ助22
   */
  c41x22: string;

  /**
   * 其他手术操作切口愈合等级22
   */
  c42x22c: string;

  /**
   * 其他手术操作麻醉方式22
   */
  c43x22c: string;

  /**
   * 其他手术操作麻醉医师22
   */
  c44x22: string;

  /**
   * 其他手术操作编码23
   */
  c35x23c: string;

  /**
   * 其他手术操作名称23
   */
  c36x23n: string;

  /**
   * 其他手术操作日期23
   */
  c37x23: string;

  /**
   * 其他手术操作级别23
   */
  c38x23: string;

  /**
   * 其他手术操作术者23
   */
  c39x23: string;

  /**
   * 其他手术操作Ⅰ助23
   */
  c40x23: string;

  /**
   * 其他手术操作Ⅱ助23
   */
  c41x23: string;

  /**
   * 其他手术操作切口愈合等级23
   */
  c42x23c: string;

  /**
   * 其他手术操作麻醉方式23
   */
  c43x23c: string;

  /**
   * 其他手术操作麻醉医师23
   */
  c44x23: string;

  /**
   * 其他手术操作编码24
   */
  c35x24c: string;

  /**
   * 其他手术操作名称24
   */
  c36x24n: string;

  /**
   * 其他手术操作日期24
   */
  c37x24: string;

  /**
   * 其他手术操作级别24
   */
  c38x24: string;

  /**
   * 其他手术操作术者24
   */
  c39x24: string;

  /**
   * 其他手术操作Ⅰ助24
   */
  c40x24: string;

  /**
   * 其他手术操作Ⅱ助24
   */
  c41x24: string;

  /**
   * 其他手术操作切口愈合等级24
   */
  c42x24c: string;

  /**
   * 其他手术操作麻醉方式24
   */
  c43x24c: string;

  /**
   * 其他手术操作麻醉医师24
   */
  c44x24: string;

  /**
   * 其他手术操作编码25
   */
  c35x25c: string;

  /**
   * 其他手术操作名称25
   */
  c36x25n: string;

  /**
   * 其他手术操作日期25
   */
  c37x25: string;

  /**
   * 其他手术操作级别25
   */
  c38x25: string;

  /**
   * 其他手术操作术者25
   */
  c39x25: string;

  /**
   * 其他手术操作Ⅰ助25
   */
  c40x25: string;

  /**
   * 其他手术操作Ⅱ助25
   */
  c41x25: string;

  /**
   * 其他手术操作切口愈合等级25
   */
  c42x25c: string;

  /**
   * 其他手术操作麻醉方式25
   */
  c43x25c: string;

  /**
   * 其他手术操作麻醉医师25
   */
  c44x25: string;

  /**
   * 其他手术操作编码26
   */
  c35x26c: string;

  /**
   * 其他手术操作名称26
   */
  c36x26n: string;

  /**
   * 其他手术操作日期26
   */
  c37x26: string;

  /**
   * 其他手术操作级别26
   */
  c38x26: string;

  /**
   * 其他手术操作术者26
   */
  c39x26: string;

  /**
   * 其他手术操作Ⅰ助26
   */
  c40x26: string;

  /**
   * 其他手术操作Ⅱ助26
   */
  c41x26: string;

  /**
   * 其他手术操作切口愈合等级26
   */
  c42x26c: string;

  /**
   * 其他手术操作麻醉方式26
   */
  c43x26c: string;

  /**
   * 其他手术操作麻醉医师26
   */
  c44x26: string;

  /**
   * 其他手术操作编码27
   */
  c35x27c: string;

  /**
   * 其他手术操作名称27
   */
  c36x27n: string;

  /**
   * 其他手术操作日期27
   */
  c37x27: string;

  /**
   * 其他手术操作级别27
   */
  c38x27: string;

  /**
   * 其他手术操作术者27
   */
  c39x27: string;

  /**
   * 其他手术操作Ⅰ助27
   */
  c40x27: string;

  /**
   * 其他手术操作Ⅱ助27
   */
  c41x27: string;

  /**
   * 其他手术操作切口愈合等级27
   */
  c42x27c: string;

  /**
   * 其他手术操作麻醉方式27
   */
  c43x27c: string;

  /**
   * 其他手术操作麻醉医师27
   */
  c44x27: string;

  /**
   * 其他手术操作编码28
   */
  c35x28c: string;

  /**
   * 其他手术操作名称28
   */
  c36x28n: string;

  /**
   * 其他手术操作日期28
   */
  c37x28: string;

  /**
   * 其他手术操作级别28
   */
  c38x28: string;

  /**
   * 其他手术操作术者28
   */
  c39x28: string;

  /**
   * 其他手术操作Ⅰ助28
   */
  c40x28: string;

  /**
   * 其他手术操作Ⅱ助28
   */
  c41x28: string;

  /**
   * 其他手术操作切口愈合等级28
   */
  c42x28c: string;

  /**
   * 其他手术操作麻醉方式28
   */
  c43x28c: string;

  /**
   * 其他手术操作麻醉医师28
   */
  c44x28: string;

  /**
   * 其他手术操作编码29
   */
  c35x29c: string;

  /**
   * 其他手术操作名称29
   */
  c36x29n: string;

  /**
   * 其他手术操作日期29
   */
  c37x29: string;

  /**
   * 其他手术操作级别29
   */
  c38x29: string;

  /**
   * 其他手术操作术者29
   */
  c39x29: string;

  /**
   * 其他手术操作Ⅰ助29
   */
  c40x29: string;

  /**
   * 其他手术操作Ⅱ助29
   */
  c41x29: string;

  /**
   * 其他手术操作切口愈合等级29
   */
  c42x29c: string;

  /**
   * 其他手术操作麻醉方式29
   */
  c43x29c: string;

  /**
   * 其他手术操作麻醉医师29
   */
  c44x29: string;

  /**
   * 其他手术操作编码30
   */
  c35x30c: string;

  /**
   * 其他手术操作名称30
   */
  c36x30n: string;

  /**
   * 其他手术操作日期30
   */
  c37x30: string;

  /**
   * 其他手术操作级别30
   */
  c38x30: string;

  /**
   * 其他手术操作术者30
   */
  c39x30: string;

  /**
   * 其他手术操作Ⅰ助30
   */
  c40x30: string;

  /**
   * 其他手术操作Ⅱ助30
   */
  c41x30: string;

  /**
   * 其他手术操作切口愈合等级30
   */
  c42x30c: string;

  /**
   * 其他手术操作麻醉方式30
   */
  c43x30c: string;

  /**
   * 其他手术操作麻醉医师30
   */
  c44x30: string;

  /**
   * 其他手术操作编码31
   */
  c35x31c: string;

  /**
   * 其他手术操作名称31
   */
  c36x31n: string;

  /**
   * 其他手术操作日期31
   */
  c37x31: string;

  /**
   * 其他手术操作级别31
   */
  c38x31: string;

  /**
   * 其他手术操作术者31
   */
  c39x31: string;

  /**
   * 其他手术操作Ⅰ助31
   */
  c40x31: string;

  /**
   * 其他手术操作Ⅱ助31
   */
  c41x31: string;

  /**
   * 其他手术操作切口愈合等级31
   */
  c42x31c: string;

  /**
   * 其他手术操作麻醉方式31
   */
  c43x31c: string;

  /**
   * 其他手术操作麻醉医师31
   */
  c44x31: string;

  /**
   * 其他手术操作编码32
   */
  c35x32c: string;

  /**
   * 其他手术操作名称32
   */
  c36x32n: string;

  /**
   * 其他手术操作日期32
   */
  c37x32: string;

  /**
   * 其他手术操作级别32
   */
  c38x32: string;

  /**
   * 其他手术操作术者32
   */
  c39x32: string;

  /**
   * 其他手术操作Ⅰ助32
   */
  c40x32: string;

  /**
   * 其他手术操作Ⅱ助32
   */
  c41x32: string;

  /**
   * 其他手术操作切口愈合等级32
   */
  c42x32c: string;

  /**
   * 其他手术操作麻醉方式32
   */
  c43x32c: string;

  /**
   * 其他手术操作麻醉医师32
   */
  c44x32: string;

  /**
   * 其他手术操作编码33
   */
  c35x33c: string;

  /**
   * 其他手术操作名称33
   */
  c36x33n: string;

  /**
   * 其他手术操作日期33
   */
  c37x33: string;

  /**
   * 其他手术操作级别33
   */
  c38x33: string;

  /**
   * 其他手术操作术者33
   */
  c39x33: string;

  /**
   * 其他手术操作Ⅰ助33
   */
  c40x33: string;

  /**
   * 其他手术操作Ⅱ助33
   */
  c41x33: string;

  /**
   * 其他手术操作切口愈合等级33
   */
  c42x33c: string;

  /**
   * 其他手术操作麻醉方式33
   */
  c43x33c: string;

  /**
   * 其他手术操作麻醉医师33
   */
  c44x33: string;

  /**
   * 其他手术操作编码34
   */
  c35x34c: string;

  /**
   * 其他手术操作名称34
   */
  c36x34n: string;

  /**
   * 其他手术操作日期34
   */
  c37x34: string;

  /**
   * 其他手术操作级别34
   */
  c38x34: string;

  /**
   * 其他手术操作术者34
   */
  c39x34: string;

  /**
   * 其他手术操作Ⅰ助34
   */
  c40x34: string;

  /**
   * 其他手术操作Ⅱ助34
   */
  c41x34: string;

  /**
   * 其他手术操作切口愈合等级34
   */
  c42x34c: string;

  /**
   * 其他手术操作麻醉方式34
   */
  c43x34c: string;

  /**
   * 其他手术操作麻醉医师34
   */
  c44x34: string;

  /**
   * 其他手术操作编码35
   */
  c35x35c: string;

  /**
   * 其他手术操作名称35
   */
  c36x35n: string;

  /**
   * 其他手术操作日期35
   */
  c37x35: string;

  /**
   * 其他手术操作级别35
   */
  c38x35: string;

  /**
   * 其他手术操作术者35
   */
  c39x35: string;

  /**
   * 其他手术操作Ⅰ助35
   */
  c40x35: string;

  /**
   * 其他手术操作Ⅱ助35
   */
  c41x35: string;

  /**
   * 其他手术操作切口愈合等级35
   */
  c42x35c: string;

  /**
   * 其他手术操作麻醉方式35
   */
  c43x35c: string;

  /**
   * 其他手术操作麻醉医师35
   */
  c44x35: string;

  /**
   * 其他手术操作编码36
   */
  c35x36c: string;

  /**
   * 其他手术操作名称36
   */
  c36x36n: string;

  /**
   * 其他手术操作日期36
   */
  c37x36: string;

  /**
   * 其他手术操作级别36
   */
  c38x36: string;

  /**
   * 其他手术操作术者36
   */
  c39x36: string;

  /**
   * 其他手术操作Ⅰ助36
   */
  c40x36: string;

  /**
   * 其他手术操作Ⅱ助36
   */
  c41x36: string;

  /**
   * 其他手术操作切口愈合等级36
   */
  c42x36c: string;

  /**
   * 其他手术操作麻醉方式36
   */
  c43x36c: string;

  /**
   * 其他手术操作麻醉医师36
   */
  c44x36: string;

  /**
   * 其他手术操作编码37
   */
  c35x37c: string;

  /**
   * 其他手术操作名称37
   */
  c36x37n: string;

  /**
   * 其他手术操作日期37
   */
  c37x37: string;

  /**
   * 其他手术操作级别37
   */
  c38x37: string;

  /**
   * 其他手术操作术者37
   */
  c39x37: string;

  /**
   * 其他手术操作Ⅰ助37
   */
  c40x37: string;

  /**
   * 其他手术操作Ⅱ助37
   */
  c41x37: string;

  /**
   * 其他手术操作切口愈合等级37
   */
  c42x37c: string;

  /**
   * 其他手术操作麻醉方式37
   */
  c43x37c: string;

  /**
   * 其他手术操作麻醉医师37
   */
  c44x37: string;

  /**
   * 其他手术操作编码38
   */
  c35x38c: string;

  /**
   * 其他手术操作名称38
   */
  c36x38n: string;

  /**
   * 其他手术操作日期38
   */
  c37x38: string;

  /**
   * 其他手术操作级别38
   */
  c38x38: string;

  /**
   * 其他手术操作术者38
   */
  c39x38: string;

  /**
   * 其他手术操作Ⅰ助38
   */
  c40x38: string;

  /**
   * 其他手术操作Ⅱ助38
   */
  c41x38: string;

  /**
   * 其他手术操作切口愈合等级38
   */
  c42x38c: string;

  /**
   * 其他手术操作麻醉方式38
   */
  c43x38c: string;

  /**
   * 其他手术操作麻醉医师38
   */
  c44x38: string;

  /**
   * 其他手术操作编码39
   */
  c35x39c: string;

  /**
   * 其他手术操作名称39
   */
  c36x39n: string;

  /**
   * 其他手术操作日期39
   */
  c37x39: string;

  /**
   * 其他手术操作级别39
   */
  c38x39: string;

  /**
   * 其他手术操作术者39
   */
  c39x39: string;

  /**
   * 其他手术操作Ⅰ助39
   */
  c40x39: string;

  /**
   * 其他手术操作Ⅱ助39
   */
  c41x39: string;

  /**
   * 其他手术操作切口愈合等级39
   */
  c42x39c: string;

  /**
   * 其他手术操作麻醉方式39
   */
  c43x39c: string;

  /**
   * 其他手术操作麻醉医师39
   */
  c44x39: string;

  /**
   * 其他手术操作编码40
   */
  c35x40c: string;

  /**
   * 其他手术操作名称40
   */
  c36x40n: string;

  /**
   * 其他手术操作日期40
   */
  c37x40: string;

  /**
   * 其他手术操作级别40
   */
  c38x40: string;

  /**
   * 其他手术操作术者40
   */
  c39x40: string;

  /**
   * 其他手术操作Ⅰ助40
   */
  c40x40: string;

  /**
   * 其他手术操作Ⅱ助40
   */
  c41x40: string;

  /**
   * 其他手术操作切口愈合等级40
   */
  c42x40c: string;

  /**
   * 其他手术操作麻醉方式40
   */
  c43x40c: string;

  /**
   * 其他手术操作麻醉医师40
   */
  c44x40: string;

  /**
   * 住院总费用
   */
  d01: number;

  /**
   * 住院总费用其中自付金额
   */
  d09: number;

  /**
   * 1.一般医疗服务费
   */
  d11: number;

  /**
   * 2.一般治疗操作费
   */
  d12: number;

  /**
   * 3.护理费
   */
  d13: number;

  /**
   * 4.综合医疗服务类其他费用
   */
  d14: number;

  /**
   * 5.病理诊断费
   */
  d15: number;

  /**
   * 6.实验室诊断费
   */
  d16: number;

  /**
   * 7.影像学诊断费
   */
  d17: number;

  /**
   * 8.临床诊断项目费
   */
  d18: number;

  /**
   * 9.非手术治疗项目费
   */
  d19: number;

  /**
   * 其中:临床物理治疗费
   */
  d19x01: number;

  /**
   * 10.手术治疗费
   */
  d20: number;

  /**
   * 其中:麻醉费
   */
  d20x01: number;

  /**
   * 其中:手术费
   */
  d20x02: number;

  /**
   * 11.康复费
   */
  d21: number;

  /**
   * 12.中医治疗费
   */
  d22: number;

  /**
   * 13.西药费
   */
  d23: number;

  /**
   * 其中:抗菌药物费
   */
  d23x01: number;

  /**
   * 14.中成药费
   */
  d24: number;

  /**
   * 15.中草药费
   */
  d25: number;

  /**
   * 16.血费
   */
  d26: number;

  /**
   * 17.白蛋白类制品费
   */
  d27: number;

  /**
   * 18.球蛋白类制品费
   */
  d28: number;

  /**
   * 19.凝血因子类制品费
   */
  d29: number;

  /**
   * 20.细胞因子类制品费
   */
  d30: number;

  /**
   * 21.检查用一次性医用材料费
   */
  d31: number;

  /**
   * 22.治疗用一次性医用材料费
   */
  d32: number;

  /**
   * 23.手术用一次性医用材料费
   */
  d33: number;

  /**
   * 24.其他费
   */
  d34: number;

  /**
   * 扩展字段1-预留
   */
  e01: string;

  /**
   * 扩展字段2-预留
   */
  e02: string;

  /**
   * 扩展字段3-预留
   */
  e03: string;

  /**
   * 扩展字段4-预留
   */
  e04: string;

  /**
   * 扩展字段5-预留时间
   */
  e05: string;

  /**
   * 扩展字段6-预留金额
   */
  e06: number;

  /**
   * 扩展字段7-预留数字
   */
  e07: number;

  /**
   * 扩展字段8-预留文本
   */
  e08: string;

  /**
   * 扩展字段9-预留布尔值
   */
  e09: number;

  /**
   * 扩展字段10-预留编码
   */
  e10: string;

}

export interface NatdssB04MedicalRecordFrontSheetNonTcmSupplementForm extends BaseEntity {
  /**
   * 患者ID
   */
  patientId?: string | number;

  /**
   * 单次就诊唯一标识号
   */
  visitSn?: string;

  /**
   * 其他手术操作编码1
   */
  c35x01c?: string;

  /**
   * 其他手术操作名称1
   */
  c36x01n?: string;

  /**
   * 其他手术操作日期1
   */
  c37x01?: string;

  /**
   * 其他手术操作级别1
   */
  c38x01?: string;

  /**
   * 其他手术操作术者1
   */
  c39x01?: string;

  /**
   * 其他手术操作Ⅰ助1
   */
  c40x01?: string;

  /**
   * 其他手术操作Ⅱ助1
   */
  c41x01?: string;

  /**
   * 其他手术操作切口愈合等级1
   */
  c42x01c?: string;

  /**
   * 其他手术操作麻醉方式1
   */
  c43x01c?: string;

  /**
   * 其他手术操作麻醉医师1
   */
  c44x01?: string;

  /**
   * 其他手术操作编码2
   */
  c35x02c?: string;

  /**
   * 其他手术操作名称2
   */
  c36x02n?: string;

  /**
   * 其他手术操作日期2
   */
  c37x02?: string;

  /**
   * 其他手术操作级别2
   */
  c38x02?: string;

  /**
   * 其他手术操作术者2
   */
  c39x02?: string;

  /**
   * 其他手术操作Ⅰ助2
   */
  c40x02?: string;

  /**
   * 其他手术操作Ⅱ助2
   */
  c41x02?: string;

  /**
   * 其他手术操作切口愈合等级2
   */
  c42x02c?: string;

  /**
   * 其他手术操作麻醉方式2
   */
  c43x02c?: string;

  /**
   * 其他手术操作麻醉医师2
   */
  c44x02?: string;

  /**
   * 其他手术操作编码3
   */
  c35x03c?: string;

  /**
   * 其他手术操作名称3
   */
  c36x03n?: string;

  /**
   * 其他手术操作日期3
   */
  c37x03?: string;

  /**
   * 其他手术操作级别3
   */
  c38x03?: string;

  /**
   * 其他手术操作术者3
   */
  c39x03?: string;

  /**
   * 其他手术操作Ⅰ助3
   */
  c40x03?: string;

  /**
   * 其他手术操作Ⅱ助3
   */
  c41x03?: string;

  /**
   * 其他手术操作切口愈合等级3
   */
  c42x03c?: string;

  /**
   * 其他手术操作麻醉方式3
   */
  c43x03c?: string;

  /**
   * 其他手术操作麻醉医师3
   */
  c44x03?: string;

  /**
   * 其他手术操作编码4
   */
  c35x04c?: string;

  /**
   * 其他手术操作名称4
   */
  c36x04n?: string;

  /**
   * 其他手术操作日期4
   */
  c37x04?: string;

  /**
   * 其他手术操作级别4
   */
  c38x04?: string;

  /**
   * 其他手术操作术者4
   */
  c39x04?: string;

  /**
   * 其他手术操作Ⅰ助4
   */
  c40x04?: string;

  /**
   * 其他手术操作Ⅱ助4
   */
  c41x04?: string;

  /**
   * 其他手术操作切口愈合等级4
   */
  c42x04c?: string;

  /**
   * 其他手术操作麻醉方式4
   */
  c43x04c?: string;

  /**
   * 其他手术操作麻醉医师4
   */
  c44x04?: string;

  /**
   * 其他手术操作编码5
   */
  c35x05c?: string;

  /**
   * 其他手术操作名称5
   */
  c36x05n?: string;

  /**
   * 其他手术操作日期5
   */
  c37x05?: string;

  /**
   * 其他手术操作级别5
   */
  c38x05?: string;

  /**
   * 其他手术操作术者5
   */
  c39x05?: string;

  /**
   * 其他手术操作Ⅰ助5
   */
  c40x05?: string;

  /**
   * 其他手术操作Ⅱ助5
   */
  c41x05?: string;

  /**
   * 其他手术操作切口愈合等级5
   */
  c42x05c?: string;

  /**
   * 其他手术操作麻醉方式5
   */
  c43x05c?: string;

  /**
   * 其他手术操作麻醉医师5
   */
  c44x05?: string;

  /**
   * 其他手术操作编码6
   */
  c35x06c?: string;

  /**
   * 其他手术操作名称6
   */
  c36x06n?: string;

  /**
   * 其他手术操作日期6
   */
  c37x06?: string;

  /**
   * 其他手术操作级别6
   */
  c38x06?: string;

  /**
   * 其他手术操作术者6
   */
  c39x06?: string;

  /**
   * 其他手术操作Ⅰ助6
   */
  c40x06?: string;

  /**
   * 其他手术操作Ⅱ助6
   */
  c41x06?: string;

  /**
   * 其他手术操作切口愈合等级6
   */
  c42x06c?: string;

  /**
   * 其他手术操作麻醉方式6
   */
  c43x06c?: string;

  /**
   * 其他手术操作麻醉医师6
   */
  c44x06?: string;

  /**
   * 其他手术操作编码7
   */
  c35x07c?: string;

  /**
   * 其他手术操作名称7
   */
  c36x07n?: string;

  /**
   * 其他手术操作日期7
   */
  c37x07?: string;

  /**
   * 其他手术操作级别7
   */
  c38x07?: string;

  /**
   * 其他手术操作术者7
   */
  c39x07?: string;

  /**
   * 其他手术操作Ⅰ助7
   */
  c40x07?: string;

  /**
   * 其他手术操作Ⅱ助7
   */
  c41x07?: string;

  /**
   * 其他手术操作切口愈合等级7
   */
  c42x07c?: string;

  /**
   * 其他手术操作麻醉方式7
   */
  c43x07c?: string;

  /**
   * 其他手术操作麻醉医师7
   */
  c44x07?: string;

  /**
   * 其他手术操作编码8
   */
  c35x08c?: string;

  /**
   * 其他手术操作名称8
   */
  c36x08n?: string;

  /**
   * 其他手术操作日期8
   */
  c37x08?: string;

  /**
   * 其他手术操作级别8
   */
  c38x08?: string;

  /**
   * 其他手术操作术者8
   */
  c39x08?: string;

  /**
   * 其他手术操作Ⅰ助8
   */
  c40x08?: string;

  /**
   * 其他手术操作Ⅱ助8
   */
  c41x08?: string;

  /**
   * 其他手术操作切口愈合等级8
   */
  c42x08c?: string;

  /**
   * 其他手术操作麻醉方式8
   */
  c43x08c?: string;

  /**
   * 其他手术操作麻醉医师8
   */
  c44x08?: string;

  /**
   * 其他手术操作编码9
   */
  c35x09c?: string;

  /**
   * 其他手术操作名称9
   */
  c36x09n?: string;

  /**
   * 其他手术操作日期9
   */
  c37x09?: string;

  /**
   * 其他手术操作级别9
   */
  c38x09?: string;

  /**
   * 其他手术操作术者9
   */
  c39x09?: string;

  /**
   * 其他手术操作Ⅰ助9
   */
  c40x09?: string;

  /**
   * 其他手术操作Ⅱ助9
   */
  c41x09?: string;

  /**
   * 其他手术操作切口愈合等级9
   */
  c42x09c?: string;

  /**
   * 其他手术操作麻醉方式9
   */
  c43x09c?: string;

  /**
   * 其他手术操作麻醉医师9
   */
  c44x09?: string;

  /**
   * 其他手术操作编码10
   */
  c35x10c?: string;

  /**
   * 其他手术操作名称10
   */
  c36x10n?: string;

  /**
   * 其他手术操作日期10
   */
  c37x10?: string;

  /**
   * 其他手术操作级别10
   */
  c38x10?: string;

  /**
   * 其他手术操作术者10
   */
  c39x10?: string;

  /**
   * 其他手术操作Ⅰ助10
   */
  c40x10?: string;

  /**
   * 其他手术操作Ⅱ助10
   */
  c41x10?: string;

  /**
   * 其他手术操作切口愈合等级10
   */
  c42x10c?: string;

  /**
   * 其他手术操作麻醉方式10
   */
  c43x10c?: string;

  /**
   * 其他手术操作麻醉医师10
   */
  c44x10?: string;

  /**
   * 其他手术操作编码11
   */
  c35x11c?: string;

  /**
   * 其他手术操作名称11
   */
  c36x11n?: string;

  /**
   * 其他手术操作日期11
   */
  c37x11?: string;

  /**
   * 其他手术操作级别11
   */
  c38x11?: string;

  /**
   * 其他手术操作术者11
   */
  c39x11?: string;

  /**
   * 其他手术操作Ⅰ助11
   */
  c40x11?: string;

  /**
   * 其他手术操作Ⅱ助11
   */
  c41x11?: string;

  /**
   * 其他手术操作切口愈合等级11
   */
  c42x11c?: string;

  /**
   * 其他手术操作麻醉方式11
   */
  c43x11c?: string;

  /**
   * 其他手术操作麻醉医师11
   */
  c44x11?: string;

  /**
   * 其他手术操作编码12
   */
  c35x12c?: string;

  /**
   * 其他手术操作名称12
   */
  c36x12n?: string;

  /**
   * 其他手术操作日期12
   */
  c37x12?: string;

  /**
   * 其他手术操作级别12
   */
  c38x12?: string;

  /**
   * 其他手术操作术者12
   */
  c39x12?: string;

  /**
   * 其他手术操作Ⅰ助12
   */
  c40x12?: string;

  /**
   * 其他手术操作Ⅱ助12
   */
  c41x12?: string;

  /**
   * 其他手术操作切口愈合等级12
   */
  c42x12c?: string;

  /**
   * 其他手术操作麻醉方式12
   */
  c43x12c?: string;

  /**
   * 其他手术操作麻醉医师12
   */
  c44x12?: string;

  /**
   * 其他手术操作编码13
   */
  c35x13c?: string;

  /**
   * 其他手术操作名称13
   */
  c36x13n?: string;

  /**
   * 其他手术操作日期13
   */
  c37x13?: string;

  /**
   * 其他手术操作级别13
   */
  c38x13?: string;

  /**
   * 其他手术操作术者13
   */
  c39x13?: string;

  /**
   * 其他手术操作Ⅰ助13
   */
  c40x13?: string;

  /**
   * 其他手术操作Ⅱ助13
   */
  c41x13?: string;

  /**
   * 其他手术操作切口愈合等级13
   */
  c42x13c?: string;

  /**
   * 其他手术操作麻醉方式13
   */
  c43x13c?: string;

  /**
   * 其他手术操作麻醉医师13
   */
  c44x13?: string;

  /**
   * 其他手术操作编码14
   */
  c35x14c?: string;

  /**
   * 其他手术操作名称14
   */
  c36x14n?: string;

  /**
   * 其他手术操作日期14
   */
  c37x14?: string;

  /**
   * 其他手术操作级别14
   */
  c38x14?: string;

  /**
   * 其他手术操作术者14
   */
  c39x14?: string;

  /**
   * 其他手术操作Ⅰ助14
   */
  c40x14?: string;

  /**
   * 其他手术操作Ⅱ助14
   */
  c41x14?: string;

  /**
   * 其他手术操作切口愈合等级14
   */
  c42x14c?: string;

  /**
   * 其他手术操作麻醉方式14
   */
  c43x14c?: string;

  /**
   * 其他手术操作麻醉医师14
   */
  c44x14?: string;

  /**
   * 其他手术操作编码15
   */
  c35x15c?: string;

  /**
   * 其他手术操作名称15
   */
  c36x15n?: string;

  /**
   * 其他手术操作日期15
   */
  c37x15?: string;

  /**
   * 其他手术操作级别15
   */
  c38x15?: string;

  /**
   * 其他手术操作术者15
   */
  c39x15?: string;

  /**
   * 其他手术操作Ⅰ助15
   */
  c40x15?: string;

  /**
   * 其他手术操作Ⅱ助15
   */
  c41x15?: string;

  /**
   * 其他手术操作切口愈合等级15
   */
  c42x15c?: string;

  /**
   * 其他手术操作麻醉方式15
   */
  c43x15c?: string;

  /**
   * 其他手术操作麻醉医师15
   */
  c44x15?: string;

  /**
   * 其他手术操作编码16
   */
  c35x16c?: string;

  /**
   * 其他手术操作名称16
   */
  c36x16n?: string;

  /**
   * 其他手术操作日期16
   */
  c37x16?: string;

  /**
   * 其他手术操作级别16
   */
  c38x16?: string;

  /**
   * 其他手术操作术者16
   */
  c39x16?: string;

  /**
   * 其他手术操作Ⅰ助16
   */
  c40x16?: string;

  /**
   * 其他手术操作Ⅱ助16
   */
  c41x16?: string;

  /**
   * 其他手术操作切口愈合等级16
   */
  c42x16c?: string;

  /**
   * 其他手术操作麻醉方式16
   */
  c43x16c?: string;

  /**
   * 其他手术操作麻醉医师16
   */
  c44x16?: string;

  /**
   * 其他手术操作编码17
   */
  c35x17c?: string;

  /**
   * 其他手术操作名称17
   */
  c36x17n?: string;

  /**
   * 其他手术操作日期17
   */
  c37x17?: string;

  /**
   * 其他手术操作级别17
   */
  c38x17?: string;

  /**
   * 其他手术操作术者17
   */
  c39x17?: string;

  /**
   * 其他手术操作Ⅰ助17
   */
  c40x17?: string;

  /**
   * 其他手术操作Ⅱ助17
   */
  c41x17?: string;

  /**
   * 其他手术操作切口愈合等级17
   */
  c42x17c?: string;

  /**
   * 其他手术操作麻醉方式17
   */
  c43x17c?: string;

  /**
   * 其他手术操作麻醉医师17
   */
  c44x17?: string;

  /**
   * 其他手术操作编码18
   */
  c35x18c?: string;

  /**
   * 其他手术操作名称18
   */
  c36x18n?: string;

  /**
   * 其他手术操作日期18
   */
  c37x18?: string;

  /**
   * 其他手术操作级别18
   */
  c38x18?: string;

  /**
   * 其他手术操作术者18
   */
  c39x18?: string;

  /**
   * 其他手术操作Ⅰ助18
   */
  c40x18?: string;

  /**
   * 其他手术操作Ⅱ助18
   */
  c41x18?: string;

  /**
   * 其他手术操作切口愈合等级18
   */
  c42x18c?: string;

  /**
   * 其他手术操作麻醉方式18
   */
  c43x18c?: string;

  /**
   * 其他手术操作麻醉医师18
   */
  c44x18?: string;

  /**
   * 其他手术操作编码19
   */
  c35x19c?: string;

  /**
   * 其他手术操作名称19
   */
  c36x19n?: string;

  /**
   * 其他手术操作日期19
   */
  c37x19?: string;

  /**
   * 其他手术操作级别19
   */
  c38x19?: string;

  /**
   * 其他手术操作术者19
   */
  c39x19?: string;

  /**
   * 其他手术操作Ⅰ助19
   */
  c40x19?: string;

  /**
   * 其他手术操作Ⅱ助19
   */
  c41x19?: string;

  /**
   * 其他手术操作切口愈合等级19
   */
  c42x19c?: string;

  /**
   * 其他手术操作麻醉方式19
   */
  c43x19c?: string;

  /**
   * 其他手术操作麻醉医师19
   */
  c44x19?: string;

  /**
   * 其他手术操作编码20
   */
  c35x20c?: string;

  /**
   * 其他手术操作名称20
   */
  c36x20n?: string;

  /**
   * 其他手术操作日期20
   */
  c37x20?: string;

  /**
   * 其他手术操作级别20
   */
  c38x20?: string;

  /**
   * 其他手术操作术者20
   */
  c39x20?: string;

  /**
   * 其他手术操作Ⅰ助20
   */
  c40x20?: string;

  /**
   * 其他手术操作Ⅱ助20
   */
  c41x20?: string;

  /**
   * 其他手术操作切口愈合等级20
   */
  c42x20c?: string;

  /**
   * 其他手术操作麻醉方式20
   */
  c43x20c?: string;

  /**
   * 其他手术操作麻醉医师20
   */
  c44x20?: string;

  /**
   * 其他手术操作编码21
   */
  c35x21c?: string;

  /**
   * 其他手术操作名称21
   */
  c36x21n?: string;

  /**
   * 其他手术操作日期21
   */
  c37x21?: string;

  /**
   * 其他手术操作级别21
   */
  c38x21?: string;

  /**
   * 其他手术操作术者21
   */
  c39x21?: string;

  /**
   * 其他手术操作Ⅰ助21
   */
  c40x21?: string;

  /**
   * 其他手术操作Ⅱ助21
   */
  c41x21?: string;

  /**
   * 其他手术操作切口愈合等级21
   */
  c42x21c?: string;

  /**
   * 其他手术操作麻醉方式21
   */
  c43x21c?: string;

  /**
   * 其他手术操作麻醉医师21
   */
  c44x21?: string;

  /**
   * 其他手术操作编码22
   */
  c35x22c?: string;

  /**
   * 其他手术操作名称22
   */
  c36x22n?: string;

  /**
   * 其他手术操作日期22
   */
  c37x22?: string;

  /**
   * 其他手术操作级别22
   */
  c38x22?: string;

  /**
   * 其他手术操作术者22
   */
  c39x22?: string;

  /**
   * 其他手术操作Ⅰ助22
   */
  c40x22?: string;

  /**
   * 其他手术操作Ⅱ助22
   */
  c41x22?: string;

  /**
   * 其他手术操作切口愈合等级22
   */
  c42x22c?: string;

  /**
   * 其他手术操作麻醉方式22
   */
  c43x22c?: string;

  /**
   * 其他手术操作麻醉医师22
   */
  c44x22?: string;

  /**
   * 其他手术操作编码23
   */
  c35x23c?: string;

  /**
   * 其他手术操作名称23
   */
  c36x23n?: string;

  /**
   * 其他手术操作日期23
   */
  c37x23?: string;

  /**
   * 其他手术操作级别23
   */
  c38x23?: string;

  /**
   * 其他手术操作术者23
   */
  c39x23?: string;

  /**
   * 其他手术操作Ⅰ助23
   */
  c40x23?: string;

  /**
   * 其他手术操作Ⅱ助23
   */
  c41x23?: string;

  /**
   * 其他手术操作切口愈合等级23
   */
  c42x23c?: string;

  /**
   * 其他手术操作麻醉方式23
   */
  c43x23c?: string;

  /**
   * 其他手术操作麻醉医师23
   */
  c44x23?: string;

  /**
   * 其他手术操作编码24
   */
  c35x24c?: string;

  /**
   * 其他手术操作名称24
   */
  c36x24n?: string;

  /**
   * 其他手术操作日期24
   */
  c37x24?: string;

  /**
   * 其他手术操作级别24
   */
  c38x24?: string;

  /**
   * 其他手术操作术者24
   */
  c39x24?: string;

  /**
   * 其他手术操作Ⅰ助24
   */
  c40x24?: string;

  /**
   * 其他手术操作Ⅱ助24
   */
  c41x24?: string;

  /**
   * 其他手术操作切口愈合等级24
   */
  c42x24c?: string;

  /**
   * 其他手术操作麻醉方式24
   */
  c43x24c?: string;

  /**
   * 其他手术操作麻醉医师24
   */
  c44x24?: string;

  /**
   * 其他手术操作编码25
   */
  c35x25c?: string;

  /**
   * 其他手术操作名称25
   */
  c36x25n?: string;

  /**
   * 其他手术操作日期25
   */
  c37x25?: string;

  /**
   * 其他手术操作级别25
   */
  c38x25?: string;

  /**
   * 其他手术操作术者25
   */
  c39x25?: string;

  /**
   * 其他手术操作Ⅰ助25
   */
  c40x25?: string;

  /**
   * 其他手术操作Ⅱ助25
   */
  c41x25?: string;

  /**
   * 其他手术操作切口愈合等级25
   */
  c42x25c?: string;

  /**
   * 其他手术操作麻醉方式25
   */
  c43x25c?: string;

  /**
   * 其他手术操作麻醉医师25
   */
  c44x25?: string;

  /**
   * 其他手术操作编码26
   */
  c35x26c?: string;

  /**
   * 其他手术操作名称26
   */
  c36x26n?: string;

  /**
   * 其他手术操作日期26
   */
  c37x26?: string;

  /**
   * 其他手术操作级别26
   */
  c38x26?: string;

  /**
   * 其他手术操作术者26
   */
  c39x26?: string;

  /**
   * 其他手术操作Ⅰ助26
   */
  c40x26?: string;

  /**
   * 其他手术操作Ⅱ助26
   */
  c41x26?: string;

  /**
   * 其他手术操作切口愈合等级26
   */
  c42x26c?: string;

  /**
   * 其他手术操作麻醉方式26
   */
  c43x26c?: string;

  /**
   * 其他手术操作麻醉医师26
   */
  c44x26?: string;

  /**
   * 其他手术操作编码27
   */
  c35x27c?: string;

  /**
   * 其他手术操作名称27
   */
  c36x27n?: string;

  /**
   * 其他手术操作日期27
   */
  c37x27?: string;

  /**
   * 其他手术操作级别27
   */
  c38x27?: string;

  /**
   * 其他手术操作术者27
   */
  c39x27?: string;

  /**
   * 其他手术操作Ⅰ助27
   */
  c40x27?: string;

  /**
   * 其他手术操作Ⅱ助27
   */
  c41x27?: string;

  /**
   * 其他手术操作切口愈合等级27
   */
  c42x27c?: string;

  /**
   * 其他手术操作麻醉方式27
   */
  c43x27c?: string;

  /**
   * 其他手术操作麻醉医师27
   */
  c44x27?: string;

  /**
   * 其他手术操作编码28
   */
  c35x28c?: string;

  /**
   * 其他手术操作名称28
   */
  c36x28n?: string;

  /**
   * 其他手术操作日期28
   */
  c37x28?: string;

  /**
   * 其他手术操作级别28
   */
  c38x28?: string;

  /**
   * 其他手术操作术者28
   */
  c39x28?: string;

  /**
   * 其他手术操作Ⅰ助28
   */
  c40x28?: string;

  /**
   * 其他手术操作Ⅱ助28
   */
  c41x28?: string;

  /**
   * 其他手术操作切口愈合等级28
   */
  c42x28c?: string;

  /**
   * 其他手术操作麻醉方式28
   */
  c43x28c?: string;

  /**
   * 其他手术操作麻醉医师28
   */
  c44x28?: string;

  /**
   * 其他手术操作编码29
   */
  c35x29c?: string;

  /**
   * 其他手术操作名称29
   */
  c36x29n?: string;

  /**
   * 其他手术操作日期29
   */
  c37x29?: string;

  /**
   * 其他手术操作级别29
   */
  c38x29?: string;

  /**
   * 其他手术操作术者29
   */
  c39x29?: string;

  /**
   * 其他手术操作Ⅰ助29
   */
  c40x29?: string;

  /**
   * 其他手术操作Ⅱ助29
   */
  c41x29?: string;

  /**
   * 其他手术操作切口愈合等级29
   */
  c42x29c?: string;

  /**
   * 其他手术操作麻醉方式29
   */
  c43x29c?: string;

  /**
   * 其他手术操作麻醉医师29
   */
  c44x29?: string;

  /**
   * 其他手术操作编码30
   */
  c35x30c?: string;

  /**
   * 其他手术操作名称30
   */
  c36x30n?: string;

  /**
   * 其他手术操作日期30
   */
  c37x30?: string;

  /**
   * 其他手术操作级别30
   */
  c38x30?: string;

  /**
   * 其他手术操作术者30
   */
  c39x30?: string;

  /**
   * 其他手术操作Ⅰ助30
   */
  c40x30?: string;

  /**
   * 其他手术操作Ⅱ助30
   */
  c41x30?: string;

  /**
   * 其他手术操作切口愈合等级30
   */
  c42x30c?: string;

  /**
   * 其他手术操作麻醉方式30
   */
  c43x30c?: string;

  /**
   * 其他手术操作麻醉医师30
   */
  c44x30?: string;

  /**
   * 其他手术操作编码31
   */
  c35x31c?: string;

  /**
   * 其他手术操作名称31
   */
  c36x31n?: string;

  /**
   * 其他手术操作日期31
   */
  c37x31?: string;

  /**
   * 其他手术操作级别31
   */
  c38x31?: string;

  /**
   * 其他手术操作术者31
   */
  c39x31?: string;

  /**
   * 其他手术操作Ⅰ助31
   */
  c40x31?: string;

  /**
   * 其他手术操作Ⅱ助31
   */
  c41x31?: string;

  /**
   * 其他手术操作切口愈合等级31
   */
  c42x31c?: string;

  /**
   * 其他手术操作麻醉方式31
   */
  c43x31c?: string;

  /**
   * 其他手术操作麻醉医师31
   */
  c44x31?: string;

  /**
   * 其他手术操作编码32
   */
  c35x32c?: string;

  /**
   * 其他手术操作名称32
   */
  c36x32n?: string;

  /**
   * 其他手术操作日期32
   */
  c37x32?: string;

  /**
   * 其他手术操作级别32
   */
  c38x32?: string;

  /**
   * 其他手术操作术者32
   */
  c39x32?: string;

  /**
   * 其他手术操作Ⅰ助32
   */
  c40x32?: string;

  /**
   * 其他手术操作Ⅱ助32
   */
  c41x32?: string;

  /**
   * 其他手术操作切口愈合等级32
   */
  c42x32c?: string;

  /**
   * 其他手术操作麻醉方式32
   */
  c43x32c?: string;

  /**
   * 其他手术操作麻醉医师32
   */
  c44x32?: string;

  /**
   * 其他手术操作编码33
   */
  c35x33c?: string;

  /**
   * 其他手术操作名称33
   */
  c36x33n?: string;

  /**
   * 其他手术操作日期33
   */
  c37x33?: string;

  /**
   * 其他手术操作级别33
   */
  c38x33?: string;

  /**
   * 其他手术操作术者33
   */
  c39x33?: string;

  /**
   * 其他手术操作Ⅰ助33
   */
  c40x33?: string;

  /**
   * 其他手术操作Ⅱ助33
   */
  c41x33?: string;

  /**
   * 其他手术操作切口愈合等级33
   */
  c42x33c?: string;

  /**
   * 其他手术操作麻醉方式33
   */
  c43x33c?: string;

  /**
   * 其他手术操作麻醉医师33
   */
  c44x33?: string;

  /**
   * 其他手术操作编码34
   */
  c35x34c?: string;

  /**
   * 其他手术操作名称34
   */
  c36x34n?: string;

  /**
   * 其他手术操作日期34
   */
  c37x34?: string;

  /**
   * 其他手术操作级别34
   */
  c38x34?: string;

  /**
   * 其他手术操作术者34
   */
  c39x34?: string;

  /**
   * 其他手术操作Ⅰ助34
   */
  c40x34?: string;

  /**
   * 其他手术操作Ⅱ助34
   */
  c41x34?: string;

  /**
   * 其他手术操作切口愈合等级34
   */
  c42x34c?: string;

  /**
   * 其他手术操作麻醉方式34
   */
  c43x34c?: string;

  /**
   * 其他手术操作麻醉医师34
   */
  c44x34?: string;

  /**
   * 其他手术操作编码35
   */
  c35x35c?: string;

  /**
   * 其他手术操作名称35
   */
  c36x35n?: string;

  /**
   * 其他手术操作日期35
   */
  c37x35?: string;

  /**
   * 其他手术操作级别35
   */
  c38x35?: string;

  /**
   * 其他手术操作术者35
   */
  c39x35?: string;

  /**
   * 其他手术操作Ⅰ助35
   */
  c40x35?: string;

  /**
   * 其他手术操作Ⅱ助35
   */
  c41x35?: string;

  /**
   * 其他手术操作切口愈合等级35
   */
  c42x35c?: string;

  /**
   * 其他手术操作麻醉方式35
   */
  c43x35c?: string;

  /**
   * 其他手术操作麻醉医师35
   */
  c44x35?: string;

  /**
   * 其他手术操作编码36
   */
  c35x36c?: string;

  /**
   * 其他手术操作名称36
   */
  c36x36n?: string;

  /**
   * 其他手术操作日期36
   */
  c37x36?: string;

  /**
   * 其他手术操作级别36
   */
  c38x36?: string;

  /**
   * 其他手术操作术者36
   */
  c39x36?: string;

  /**
   * 其他手术操作Ⅰ助36
   */
  c40x36?: string;

  /**
   * 其他手术操作Ⅱ助36
   */
  c41x36?: string;

  /**
   * 其他手术操作切口愈合等级36
   */
  c42x36c?: string;

  /**
   * 其他手术操作麻醉方式36
   */
  c43x36c?: string;

  /**
   * 其他手术操作麻醉医师36
   */
  c44x36?: string;

  /**
   * 其他手术操作编码37
   */
  c35x37c?: string;

  /**
   * 其他手术操作名称37
   */
  c36x37n?: string;

  /**
   * 其他手术操作日期37
   */
  c37x37?: string;

  /**
   * 其他手术操作级别37
   */
  c38x37?: string;

  /**
   * 其他手术操作术者37
   */
  c39x37?: string;

  /**
   * 其他手术操作Ⅰ助37
   */
  c40x37?: string;

  /**
   * 其他手术操作Ⅱ助37
   */
  c41x37?: string;

  /**
   * 其他手术操作切口愈合等级37
   */
  c42x37c?: string;

  /**
   * 其他手术操作麻醉方式37
   */
  c43x37c?: string;

  /**
   * 其他手术操作麻醉医师37
   */
  c44x37?: string;

  /**
   * 其他手术操作编码38
   */
  c35x38c?: string;

  /**
   * 其他手术操作名称38
   */
  c36x38n?: string;

  /**
   * 其他手术操作日期38
   */
  c37x38?: string;

  /**
   * 其他手术操作级别38
   */
  c38x38?: string;

  /**
   * 其他手术操作术者38
   */
  c39x38?: string;

  /**
   * 其他手术操作Ⅰ助38
   */
  c40x38?: string;

  /**
   * 其他手术操作Ⅱ助38
   */
  c41x38?: string;

  /**
   * 其他手术操作切口愈合等级38
   */
  c42x38c?: string;

  /**
   * 其他手术操作麻醉方式38
   */
  c43x38c?: string;

  /**
   * 其他手术操作麻醉医师38
   */
  c44x38?: string;

  /**
   * 其他手术操作编码39
   */
  c35x39c?: string;

  /**
   * 其他手术操作名称39
   */
  c36x39n?: string;

  /**
   * 其他手术操作日期39
   */
  c37x39?: string;

  /**
   * 其他手术操作级别39
   */
  c38x39?: string;

  /**
   * 其他手术操作术者39
   */
  c39x39?: string;

  /**
   * 其他手术操作Ⅰ助39
   */
  c40x39?: string;

  /**
   * 其他手术操作Ⅱ助39
   */
  c41x39?: string;

  /**
   * 其他手术操作切口愈合等级39
   */
  c42x39c?: string;

  /**
   * 其他手术操作麻醉方式39
   */
  c43x39c?: string;

  /**
   * 其他手术操作麻醉医师39
   */
  c44x39?: string;

  /**
   * 其他手术操作编码40
   */
  c35x40c?: string;

  /**
   * 其他手术操作名称40
   */
  c36x40n?: string;

  /**
   * 其他手术操作日期40
   */
  c37x40?: string;

  /**
   * 其他手术操作级别40
   */
  c38x40?: string;

  /**
   * 其他手术操作术者40
   */
  c39x40?: string;

  /**
   * 其他手术操作Ⅰ助40
   */
  c40x40?: string;

  /**
   * 其他手术操作Ⅱ助40
   */
  c41x40?: string;

  /**
   * 其他手术操作切口愈合等级40
   */
  c42x40c?: string;

  /**
   * 其他手术操作麻醉方式40
   */
  c43x40c?: string;

  /**
   * 其他手术操作麻醉医师40
   */
  c44x40?: string;

  /**
   * 住院总费用
   */
  d01?: number;

  /**
   * 住院总费用其中自付金额
   */
  d09?: number;

  /**
   * 1.一般医疗服务费
   */
  d11?: number;

  /**
   * 2.一般治疗操作费
   */
  d12?: number;

  /**
   * 3.护理费
   */
  d13?: number;

  /**
   * 4.综合医疗服务类其他费用
   */
  d14?: number;

  /**
   * 5.病理诊断费
   */
  d15?: number;

  /**
   * 6.实验室诊断费
   */
  d16?: number;

  /**
   * 7.影像学诊断费
   */
  d17?: number;

  /**
   * 8.临床诊断项目费
   */
  d18?: number;

  /**
   * 9.非手术治疗项目费
   */
  d19?: number;

  /**
   * 其中:临床物理治疗费
   */
  d19x01?: number;

  /**
   * 10.手术治疗费
   */
  d20?: number;

  /**
   * 其中:麻醉费
   */
  d20x01?: number;

  /**
   * 其中:手术费
   */
  d20x02?: number;

  /**
   * 11.康复费
   */
  d21?: number;

  /**
   * 12.中医治疗费
   */
  d22?: number;

  /**
   * 13.西药费
   */
  d23?: number;

  /**
   * 其中:抗菌药物费
   */
  d23x01?: number;

  /**
   * 14.中成药费
   */
  d24?: number;

  /**
   * 15.中草药费
   */
  d25?: number;

  /**
   * 16.血费
   */
  d26?: number;

  /**
   * 17.白蛋白类制品费
   */
  d27?: number;

  /**
   * 18.球蛋白类制品费
   */
  d28?: number;

  /**
   * 19.凝血因子类制品费
   */
  d29?: number;

  /**
   * 20.细胞因子类制品费
   */
  d30?: number;

  /**
   * 21.检查用一次性医用材料费
   */
  d31?: number;

  /**
   * 22.治疗用一次性医用材料费
   */
  d32?: number;

  /**
   * 23.手术用一次性医用材料费
   */
  d33?: number;

  /**
   * 24.其他费
   */
  d34?: number;

  /**
   * 扩展字段1-预留
   */
  e01?: string;

  /**
   * 扩展字段2-预留
   */
  e02?: string;

  /**
   * 扩展字段3-预留
   */
  e03?: string;

  /**
   * 扩展字段4-预留
   */
  e04?: string;

  /**
   * 扩展字段5-预留时间
   */
  e05?: string;

  /**
   * 扩展字段6-预留金额
   */
  e06?: number;

  /**
   * 扩展字段7-预留数字
   */
  e07?: number;

  /**
   * 扩展字段8-预留文本
   */
  e08?: string;

  /**
   * 扩展字段9-预留布尔值
   */
  e09?: number;

  /**
   * 扩展字段10-预留编码
   */
  e10?: string;

}

export interface NatdssB04MedicalRecordFrontSheetNonTcmSupplementQuery extends PageQuery {

  /**
   * 其他手术操作编码1
   */
  c35x01c?: string;

  /**
   * 其他手术操作名称1
   */
  c36x01n?: string;

  /**
   * 其他手术操作日期1
   */
  c37x01?: string;

  /**
   * 其他手术操作级别1
   */
  c38x01?: string;

  /**
   * 其他手术操作术者1
   */
  c39x01?: string;

  /**
   * 其他手术操作Ⅰ助1
   */
  c40x01?: string;

  /**
   * 其他手术操作Ⅱ助1
   */
  c41x01?: string;

  /**
   * 其他手术操作切口愈合等级1
   */
  c42x01c?: string;

  /**
   * 其他手术操作麻醉方式1
   */
  c43x01c?: string;

  /**
   * 其他手术操作麻醉医师1
   */
  c44x01?: string;

  /**
   * 其他手术操作编码2
   */
  c35x02c?: string;

  /**
   * 其他手术操作名称2
   */
  c36x02n?: string;

  /**
   * 其他手术操作日期2
   */
  c37x02?: string;

  /**
   * 其他手术操作级别2
   */
  c38x02?: string;

  /**
   * 其他手术操作术者2
   */
  c39x02?: string;

  /**
   * 其他手术操作Ⅰ助2
   */
  c40x02?: string;

  /**
   * 其他手术操作Ⅱ助2
   */
  c41x02?: string;

  /**
   * 其他手术操作切口愈合等级2
   */
  c42x02c?: string;

  /**
   * 其他手术操作麻醉方式2
   */
  c43x02c?: string;

  /**
   * 其他手术操作麻醉医师2
   */
  c44x02?: string;

  /**
   * 其他手术操作编码3
   */
  c35x03c?: string;

  /**
   * 其他手术操作名称3
   */
  c36x03n?: string;

  /**
   * 其他手术操作日期3
   */
  c37x03?: string;

  /**
   * 其他手术操作级别3
   */
  c38x03?: string;

  /**
   * 其他手术操作术者3
   */
  c39x03?: string;

  /**
   * 其他手术操作Ⅰ助3
   */
  c40x03?: string;

  /**
   * 其他手术操作Ⅱ助3
   */
  c41x03?: string;

  /**
   * 其他手术操作切口愈合等级3
   */
  c42x03c?: string;

  /**
   * 其他手术操作麻醉方式3
   */
  c43x03c?: string;

  /**
   * 其他手术操作麻醉医师3
   */
  c44x03?: string;

  /**
   * 其他手术操作编码4
   */
  c35x04c?: string;

  /**
   * 其他手术操作名称4
   */
  c36x04n?: string;

  /**
   * 其他手术操作日期4
   */
  c37x04?: string;

  /**
   * 其他手术操作级别4
   */
  c38x04?: string;

  /**
   * 其他手术操作术者4
   */
  c39x04?: string;

  /**
   * 其他手术操作Ⅰ助4
   */
  c40x04?: string;

  /**
   * 其他手术操作Ⅱ助4
   */
  c41x04?: string;

  /**
   * 其他手术操作切口愈合等级4
   */
  c42x04c?: string;

  /**
   * 其他手术操作麻醉方式4
   */
  c43x04c?: string;

  /**
   * 其他手术操作麻醉医师4
   */
  c44x04?: string;

  /**
   * 其他手术操作编码5
   */
  c35x05c?: string;

  /**
   * 其他手术操作名称5
   */
  c36x05n?: string;

  /**
   * 其他手术操作日期5
   */
  c37x05?: string;

  /**
   * 其他手术操作级别5
   */
  c38x05?: string;

  /**
   * 其他手术操作术者5
   */
  c39x05?: string;

  /**
   * 其他手术操作Ⅰ助5
   */
  c40x05?: string;

  /**
   * 其他手术操作Ⅱ助5
   */
  c41x05?: string;

  /**
   * 其他手术操作切口愈合等级5
   */
  c42x05c?: string;

  /**
   * 其他手术操作麻醉方式5
   */
  c43x05c?: string;

  /**
   * 其他手术操作麻醉医师5
   */
  c44x05?: string;

  /**
   * 其他手术操作编码6
   */
  c35x06c?: string;

  /**
   * 其他手术操作名称6
   */
  c36x06n?: string;

  /**
   * 其他手术操作日期6
   */
  c37x06?: string;

  /**
   * 其他手术操作级别6
   */
  c38x06?: string;

  /**
   * 其他手术操作术者6
   */
  c39x06?: string;

  /**
   * 其他手术操作Ⅰ助6
   */
  c40x06?: string;

  /**
   * 其他手术操作Ⅱ助6
   */
  c41x06?: string;

  /**
   * 其他手术操作切口愈合等级6
   */
  c42x06c?: string;

  /**
   * 其他手术操作麻醉方式6
   */
  c43x06c?: string;

  /**
   * 其他手术操作麻醉医师6
   */
  c44x06?: string;

  /**
   * 其他手术操作编码7
   */
  c35x07c?: string;

  /**
   * 其他手术操作名称7
   */
  c36x07n?: string;

  /**
   * 其他手术操作日期7
   */
  c37x07?: string;

  /**
   * 其他手术操作级别7
   */
  c38x07?: string;

  /**
   * 其他手术操作术者7
   */
  c39x07?: string;

  /**
   * 其他手术操作Ⅰ助7
   */
  c40x07?: string;

  /**
   * 其他手术操作Ⅱ助7
   */
  c41x07?: string;

  /**
   * 其他手术操作切口愈合等级7
   */
  c42x07c?: string;

  /**
   * 其他手术操作麻醉方式7
   */
  c43x07c?: string;

  /**
   * 其他手术操作麻醉医师7
   */
  c44x07?: string;

  /**
   * 其他手术操作编码8
   */
  c35x08c?: string;

  /**
   * 其他手术操作名称8
   */
  c36x08n?: string;

  /**
   * 其他手术操作日期8
   */
  c37x08?: string;

  /**
   * 其他手术操作级别8
   */
  c38x08?: string;

  /**
   * 其他手术操作术者8
   */
  c39x08?: string;

  /**
   * 其他手术操作Ⅰ助8
   */
  c40x08?: string;

  /**
   * 其他手术操作Ⅱ助8
   */
  c41x08?: string;

  /**
   * 其他手术操作切口愈合等级8
   */
  c42x08c?: string;

  /**
   * 其他手术操作麻醉方式8
   */
  c43x08c?: string;

  /**
   * 其他手术操作麻醉医师8
   */
  c44x08?: string;

  /**
   * 其他手术操作编码9
   */
  c35x09c?: string;

  /**
   * 其他手术操作名称9
   */
  c36x09n?: string;

  /**
   * 其他手术操作日期9
   */
  c37x09?: string;

  /**
   * 其他手术操作级别9
   */
  c38x09?: string;

  /**
   * 其他手术操作术者9
   */
  c39x09?: string;

  /**
   * 其他手术操作Ⅰ助9
   */
  c40x09?: string;

  /**
   * 其他手术操作Ⅱ助9
   */
  c41x09?: string;

  /**
   * 其他手术操作切口愈合等级9
   */
  c42x09c?: string;

  /**
   * 其他手术操作麻醉方式9
   */
  c43x09c?: string;

  /**
   * 其他手术操作麻醉医师9
   */
  c44x09?: string;

  /**
   * 其他手术操作编码10
   */
  c35x10c?: string;

  /**
   * 其他手术操作名称10
   */
  c36x10n?: string;

  /**
   * 其他手术操作日期10
   */
  c37x10?: string;

  /**
   * 其他手术操作级别10
   */
  c38x10?: string;

  /**
   * 其他手术操作术者10
   */
  c39x10?: string;

  /**
   * 其他手术操作Ⅰ助10
   */
  c40x10?: string;

  /**
   * 其他手术操作Ⅱ助10
   */
  c41x10?: string;

  /**
   * 其他手术操作切口愈合等级10
   */
  c42x10c?: string;

  /**
   * 其他手术操作麻醉方式10
   */
  c43x10c?: string;

  /**
   * 其他手术操作麻醉医师10
   */
  c44x10?: string;

  /**
   * 其他手术操作编码11
   */
  c35x11c?: string;

  /**
   * 其他手术操作名称11
   */
  c36x11n?: string;

  /**
   * 其他手术操作日期11
   */
  c37x11?: string;

  /**
   * 其他手术操作级别11
   */
  c38x11?: string;

  /**
   * 其他手术操作术者11
   */
  c39x11?: string;

  /**
   * 其他手术操作Ⅰ助11
   */
  c40x11?: string;

  /**
   * 其他手术操作Ⅱ助11
   */
  c41x11?: string;

  /**
   * 其他手术操作切口愈合等级11
   */
  c42x11c?: string;

  /**
   * 其他手术操作麻醉方式11
   */
  c43x11c?: string;

  /**
   * 其他手术操作麻醉医师11
   */
  c44x11?: string;

  /**
   * 其他手术操作编码12
   */
  c35x12c?: string;

  /**
   * 其他手术操作名称12
   */
  c36x12n?: string;

  /**
   * 其他手术操作日期12
   */
  c37x12?: string;

  /**
   * 其他手术操作级别12
   */
  c38x12?: string;

  /**
   * 其他手术操作术者12
   */
  c39x12?: string;

  /**
   * 其他手术操作Ⅰ助12
   */
  c40x12?: string;

  /**
   * 其他手术操作Ⅱ助12
   */
  c41x12?: string;

  /**
   * 其他手术操作切口愈合等级12
   */
  c42x12c?: string;

  /**
   * 其他手术操作麻醉方式12
   */
  c43x12c?: string;

  /**
   * 其他手术操作麻醉医师12
   */
  c44x12?: string;

  /**
   * 其他手术操作编码13
   */
  c35x13c?: string;

  /**
   * 其他手术操作名称13
   */
  c36x13n?: string;

  /**
   * 其他手术操作日期13
   */
  c37x13?: string;

  /**
   * 其他手术操作级别13
   */
  c38x13?: string;

  /**
   * 其他手术操作术者13
   */
  c39x13?: string;

  /**
   * 其他手术操作Ⅰ助13
   */
  c40x13?: string;

  /**
   * 其他手术操作Ⅱ助13
   */
  c41x13?: string;

  /**
   * 其他手术操作切口愈合等级13
   */
  c42x13c?: string;

  /**
   * 其他手术操作麻醉方式13
   */
  c43x13c?: string;

  /**
   * 其他手术操作麻醉医师13
   */
  c44x13?: string;

  /**
   * 其他手术操作编码14
   */
  c35x14c?: string;

  /**
   * 其他手术操作名称14
   */
  c36x14n?: string;

  /**
   * 其他手术操作日期14
   */
  c37x14?: string;

  /**
   * 其他手术操作级别14
   */
  c38x14?: string;

  /**
   * 其他手术操作术者14
   */
  c39x14?: string;

  /**
   * 其他手术操作Ⅰ助14
   */
  c40x14?: string;

  /**
   * 其他手术操作Ⅱ助14
   */
  c41x14?: string;

  /**
   * 其他手术操作切口愈合等级14
   */
  c42x14c?: string;

  /**
   * 其他手术操作麻醉方式14
   */
  c43x14c?: string;

  /**
   * 其他手术操作麻醉医师14
   */
  c44x14?: string;

  /**
   * 其他手术操作编码15
   */
  c35x15c?: string;

  /**
   * 其他手术操作名称15
   */
  c36x15n?: string;

  /**
   * 其他手术操作日期15
   */
  c37x15?: string;

  /**
   * 其他手术操作级别15
   */
  c38x15?: string;

  /**
   * 其他手术操作术者15
   */
  c39x15?: string;

  /**
   * 其他手术操作Ⅰ助15
   */
  c40x15?: string;

  /**
   * 其他手术操作Ⅱ助15
   */
  c41x15?: string;

  /**
   * 其他手术操作切口愈合等级15
   */
  c42x15c?: string;

  /**
   * 其他手术操作麻醉方式15
   */
  c43x15c?: string;

  /**
   * 其他手术操作麻醉医师15
   */
  c44x15?: string;

  /**
   * 其他手术操作编码16
   */
  c35x16c?: string;

  /**
   * 其他手术操作名称16
   */
  c36x16n?: string;

  /**
   * 其他手术操作日期16
   */
  c37x16?: string;

  /**
   * 其他手术操作级别16
   */
  c38x16?: string;

  /**
   * 其他手术操作术者16
   */
  c39x16?: string;

  /**
   * 其他手术操作Ⅰ助16
   */
  c40x16?: string;

  /**
   * 其他手术操作Ⅱ助16
   */
  c41x16?: string;

  /**
   * 其他手术操作切口愈合等级16
   */
  c42x16c?: string;

  /**
   * 其他手术操作麻醉方式16
   */
  c43x16c?: string;

  /**
   * 其他手术操作麻醉医师16
   */
  c44x16?: string;

  /**
   * 其他手术操作编码17
   */
  c35x17c?: string;

  /**
   * 其他手术操作名称17
   */
  c36x17n?: string;

  /**
   * 其他手术操作日期17
   */
  c37x17?: string;

  /**
   * 其他手术操作级别17
   */
  c38x17?: string;

  /**
   * 其他手术操作术者17
   */
  c39x17?: string;

  /**
   * 其他手术操作Ⅰ助17
   */
  c40x17?: string;

  /**
   * 其他手术操作Ⅱ助17
   */
  c41x17?: string;

  /**
   * 其他手术操作切口愈合等级17
   */
  c42x17c?: string;

  /**
   * 其他手术操作麻醉方式17
   */
  c43x17c?: string;

  /**
   * 其他手术操作麻醉医师17
   */
  c44x17?: string;

  /**
   * 其他手术操作编码18
   */
  c35x18c?: string;

  /**
   * 其他手术操作名称18
   */
  c36x18n?: string;

  /**
   * 其他手术操作日期18
   */
  c37x18?: string;

  /**
   * 其他手术操作级别18
   */
  c38x18?: string;

  /**
   * 其他手术操作术者18
   */
  c39x18?: string;

  /**
   * 其他手术操作Ⅰ助18
   */
  c40x18?: string;

  /**
   * 其他手术操作Ⅱ助18
   */
  c41x18?: string;

  /**
   * 其他手术操作切口愈合等级18
   */
  c42x18c?: string;

  /**
   * 其他手术操作麻醉方式18
   */
  c43x18c?: string;

  /**
   * 其他手术操作麻醉医师18
   */
  c44x18?: string;

  /**
   * 其他手术操作编码19
   */
  c35x19c?: string;

  /**
   * 其他手术操作名称19
   */
  c36x19n?: string;

  /**
   * 其他手术操作日期19
   */
  c37x19?: string;

  /**
   * 其他手术操作级别19
   */
  c38x19?: string;

  /**
   * 其他手术操作术者19
   */
  c39x19?: string;

  /**
   * 其他手术操作Ⅰ助19
   */
  c40x19?: string;

  /**
   * 其他手术操作Ⅱ助19
   */
  c41x19?: string;

  /**
   * 其他手术操作切口愈合等级19
   */
  c42x19c?: string;

  /**
   * 其他手术操作麻醉方式19
   */
  c43x19c?: string;

  /**
   * 其他手术操作麻醉医师19
   */
  c44x19?: string;

  /**
   * 其他手术操作编码20
   */
  c35x20c?: string;

  /**
   * 其他手术操作名称20
   */
  c36x20n?: string;

  /**
   * 其他手术操作日期20
   */
  c37x20?: string;

  /**
   * 其他手术操作级别20
   */
  c38x20?: string;

  /**
   * 其他手术操作术者20
   */
  c39x20?: string;

  /**
   * 其他手术操作Ⅰ助20
   */
  c40x20?: string;

  /**
   * 其他手术操作Ⅱ助20
   */
  c41x20?: string;

  /**
   * 其他手术操作切口愈合等级20
   */
  c42x20c?: string;

  /**
   * 其他手术操作麻醉方式20
   */
  c43x20c?: string;

  /**
   * 其他手术操作麻醉医师20
   */
  c44x20?: string;

  /**
   * 其他手术操作编码21
   */
  c35x21c?: string;

  /**
   * 其他手术操作名称21
   */
  c36x21n?: string;

  /**
   * 其他手术操作日期21
   */
  c37x21?: string;

  /**
   * 其他手术操作级别21
   */
  c38x21?: string;

  /**
   * 其他手术操作术者21
   */
  c39x21?: string;

  /**
   * 其他手术操作Ⅰ助21
   */
  c40x21?: string;

  /**
   * 其他手术操作Ⅱ助21
   */
  c41x21?: string;

  /**
   * 其他手术操作切口愈合等级21
   */
  c42x21c?: string;

  /**
   * 其他手术操作麻醉方式21
   */
  c43x21c?: string;

  /**
   * 其他手术操作麻醉医师21
   */
  c44x21?: string;

  /**
   * 其他手术操作编码22
   */
  c35x22c?: string;

  /**
   * 其他手术操作名称22
   */
  c36x22n?: string;

  /**
   * 其他手术操作日期22
   */
  c37x22?: string;

  /**
   * 其他手术操作级别22
   */
  c38x22?: string;

  /**
   * 其他手术操作术者22
   */
  c39x22?: string;

  /**
   * 其他手术操作Ⅰ助22
   */
  c40x22?: string;

  /**
   * 其他手术操作Ⅱ助22
   */
  c41x22?: string;

  /**
   * 其他手术操作切口愈合等级22
   */
  c42x22c?: string;

  /**
   * 其他手术操作麻醉方式22
   */
  c43x22c?: string;

  /**
   * 其他手术操作麻醉医师22
   */
  c44x22?: string;

  /**
   * 其他手术操作编码23
   */
  c35x23c?: string;

  /**
   * 其他手术操作名称23
   */
  c36x23n?: string;

  /**
   * 其他手术操作日期23
   */
  c37x23?: string;

  /**
   * 其他手术操作级别23
   */
  c38x23?: string;

  /**
   * 其他手术操作术者23
   */
  c39x23?: string;

  /**
   * 其他手术操作Ⅰ助23
   */
  c40x23?: string;

  /**
   * 其他手术操作Ⅱ助23
   */
  c41x23?: string;

  /**
   * 其他手术操作切口愈合等级23
   */
  c42x23c?: string;

  /**
   * 其他手术操作麻醉方式23
   */
  c43x23c?: string;

  /**
   * 其他手术操作麻醉医师23
   */
  c44x23?: string;

  /**
   * 其他手术操作编码24
   */
  c35x24c?: string;

  /**
   * 其他手术操作名称24
   */
  c36x24n?: string;

  /**
   * 其他手术操作日期24
   */
  c37x24?: string;

  /**
   * 其他手术操作级别24
   */
  c38x24?: string;

  /**
   * 其他手术操作术者24
   */
  c39x24?: string;

  /**
   * 其他手术操作Ⅰ助24
   */
  c40x24?: string;

  /**
   * 其他手术操作Ⅱ助24
   */
  c41x24?: string;

  /**
   * 其他手术操作切口愈合等级24
   */
  c42x24c?: string;

  /**
   * 其他手术操作麻醉方式24
   */
  c43x24c?: string;

  /**
   * 其他手术操作麻醉医师24
   */
  c44x24?: string;

  /**
   * 其他手术操作编码25
   */
  c35x25c?: string;

  /**
   * 其他手术操作名称25
   */
  c36x25n?: string;

  /**
   * 其他手术操作日期25
   */
  c37x25?: string;

  /**
   * 其他手术操作级别25
   */
  c38x25?: string;

  /**
   * 其他手术操作术者25
   */
  c39x25?: string;

  /**
   * 其他手术操作Ⅰ助25
   */
  c40x25?: string;

  /**
   * 其他手术操作Ⅱ助25
   */
  c41x25?: string;

  /**
   * 其他手术操作切口愈合等级25
   */
  c42x25c?: string;

  /**
   * 其他手术操作麻醉方式25
   */
  c43x25c?: string;

  /**
   * 其他手术操作麻醉医师25
   */
  c44x25?: string;

  /**
   * 其他手术操作编码26
   */
  c35x26c?: string;

  /**
   * 其他手术操作名称26
   */
  c36x26n?: string;

  /**
   * 其他手术操作日期26
   */
  c37x26?: string;

  /**
   * 其他手术操作级别26
   */
  c38x26?: string;

  /**
   * 其他手术操作术者26
   */
  c39x26?: string;

  /**
   * 其他手术操作Ⅰ助26
   */
  c40x26?: string;

  /**
   * 其他手术操作Ⅱ助26
   */
  c41x26?: string;

  /**
   * 其他手术操作切口愈合等级26
   */
  c42x26c?: string;

  /**
   * 其他手术操作麻醉方式26
   */
  c43x26c?: string;

  /**
   * 其他手术操作麻醉医师26
   */
  c44x26?: string;

  /**
   * 其他手术操作编码27
   */
  c35x27c?: string;

  /**
   * 其他手术操作名称27
   */
  c36x27n?: string;

  /**
   * 其他手术操作日期27
   */
  c37x27?: string;

  /**
   * 其他手术操作级别27
   */
  c38x27?: string;

  /**
   * 其他手术操作术者27
   */
  c39x27?: string;

  /**
   * 其他手术操作Ⅰ助27
   */
  c40x27?: string;

  /**
   * 其他手术操作Ⅱ助27
   */
  c41x27?: string;

  /**
   * 其他手术操作切口愈合等级27
   */
  c42x27c?: string;

  /**
   * 其他手术操作麻醉方式27
   */
  c43x27c?: string;

  /**
   * 其他手术操作麻醉医师27
   */
  c44x27?: string;

  /**
   * 其他手术操作编码28
   */
  c35x28c?: string;

  /**
   * 其他手术操作名称28
   */
  c36x28n?: string;

  /**
   * 其他手术操作日期28
   */
  c37x28?: string;

  /**
   * 其他手术操作级别28
   */
  c38x28?: string;

  /**
   * 其他手术操作术者28
   */
  c39x28?: string;

  /**
   * 其他手术操作Ⅰ助28
   */
  c40x28?: string;

  /**
   * 其他手术操作Ⅱ助28
   */
  c41x28?: string;

  /**
   * 其他手术操作切口愈合等级28
   */
  c42x28c?: string;

  /**
   * 其他手术操作麻醉方式28
   */
  c43x28c?: string;

  /**
   * 其他手术操作麻醉医师28
   */
  c44x28?: string;

  /**
   * 其他手术操作编码29
   */
  c35x29c?: string;

  /**
   * 其他手术操作名称29
   */
  c36x29n?: string;

  /**
   * 其他手术操作日期29
   */
  c37x29?: string;

  /**
   * 其他手术操作级别29
   */
  c38x29?: string;

  /**
   * 其他手术操作术者29
   */
  c39x29?: string;

  /**
   * 其他手术操作Ⅰ助29
   */
  c40x29?: string;

  /**
   * 其他手术操作Ⅱ助29
   */
  c41x29?: string;

  /**
   * 其他手术操作切口愈合等级29
   */
  c42x29c?: string;

  /**
   * 其他手术操作麻醉方式29
   */
  c43x29c?: string;

  /**
   * 其他手术操作麻醉医师29
   */
  c44x29?: string;

  /**
   * 其他手术操作编码30
   */
  c35x30c?: string;

  /**
   * 其他手术操作名称30
   */
  c36x30n?: string;

  /**
   * 其他手术操作日期30
   */
  c37x30?: string;

  /**
   * 其他手术操作级别30
   */
  c38x30?: string;

  /**
   * 其他手术操作术者30
   */
  c39x30?: string;

  /**
   * 其他手术操作Ⅰ助30
   */
  c40x30?: string;

  /**
   * 其他手术操作Ⅱ助30
   */
  c41x30?: string;

  /**
   * 其他手术操作切口愈合等级30
   */
  c42x30c?: string;

  /**
   * 其他手术操作麻醉方式30
   */
  c43x30c?: string;

  /**
   * 其他手术操作麻醉医师30
   */
  c44x30?: string;

  /**
   * 其他手术操作编码31
   */
  c35x31c?: string;

  /**
   * 其他手术操作名称31
   */
  c36x31n?: string;

  /**
   * 其他手术操作日期31
   */
  c37x31?: string;

  /**
   * 其他手术操作级别31
   */
  c38x31?: string;

  /**
   * 其他手术操作术者31
   */
  c39x31?: string;

  /**
   * 其他手术操作Ⅰ助31
   */
  c40x31?: string;

  /**
   * 其他手术操作Ⅱ助31
   */
  c41x31?: string;

  /**
   * 其他手术操作切口愈合等级31
   */
  c42x31c?: string;

  /**
   * 其他手术操作麻醉方式31
   */
  c43x31c?: string;

  /**
   * 其他手术操作麻醉医师31
   */
  c44x31?: string;

  /**
   * 其他手术操作编码32
   */
  c35x32c?: string;

  /**
   * 其他手术操作名称32
   */
  c36x32n?: string;

  /**
   * 其他手术操作日期32
   */
  c37x32?: string;

  /**
   * 其他手术操作级别32
   */
  c38x32?: string;

  /**
   * 其他手术操作术者32
   */
  c39x32?: string;

  /**
   * 其他手术操作Ⅰ助32
   */
  c40x32?: string;

  /**
   * 其他手术操作Ⅱ助32
   */
  c41x32?: string;

  /**
   * 其他手术操作切口愈合等级32
   */
  c42x32c?: string;

  /**
   * 其他手术操作麻醉方式32
   */
  c43x32c?: string;

  /**
   * 其他手术操作麻醉医师32
   */
  c44x32?: string;

  /**
   * 其他手术操作编码33
   */
  c35x33c?: string;

  /**
   * 其他手术操作名称33
   */
  c36x33n?: string;

  /**
   * 其他手术操作日期33
   */
  c37x33?: string;

  /**
   * 其他手术操作级别33
   */
  c38x33?: string;

  /**
   * 其他手术操作术者33
   */
  c39x33?: string;

  /**
   * 其他手术操作Ⅰ助33
   */
  c40x33?: string;

  /**
   * 其他手术操作Ⅱ助33
   */
  c41x33?: string;

  /**
   * 其他手术操作切口愈合等级33
   */
  c42x33c?: string;

  /**
   * 其他手术操作麻醉方式33
   */
  c43x33c?: string;

  /**
   * 其他手术操作麻醉医师33
   */
  c44x33?: string;

  /**
   * 其他手术操作编码34
   */
  c35x34c?: string;

  /**
   * 其他手术操作名称34
   */
  c36x34n?: string;

  /**
   * 其他手术操作日期34
   */
  c37x34?: string;

  /**
   * 其他手术操作级别34
   */
  c38x34?: string;

  /**
   * 其他手术操作术者34
   */
  c39x34?: string;

  /**
   * 其他手术操作Ⅰ助34
   */
  c40x34?: string;

  /**
   * 其他手术操作Ⅱ助34
   */
  c41x34?: string;

  /**
   * 其他手术操作切口愈合等级34
   */
  c42x34c?: string;

  /**
   * 其他手术操作麻醉方式34
   */
  c43x34c?: string;

  /**
   * 其他手术操作麻醉医师34
   */
  c44x34?: string;

  /**
   * 其他手术操作编码35
   */
  c35x35c?: string;

  /**
   * 其他手术操作名称35
   */
  c36x35n?: string;

  /**
   * 其他手术操作日期35
   */
  c37x35?: string;

  /**
   * 其他手术操作级别35
   */
  c38x35?: string;

  /**
   * 其他手术操作术者35
   */
  c39x35?: string;

  /**
   * 其他手术操作Ⅰ助35
   */
  c40x35?: string;

  /**
   * 其他手术操作Ⅱ助35
   */
  c41x35?: string;

  /**
   * 其他手术操作切口愈合等级35
   */
  c42x35c?: string;

  /**
   * 其他手术操作麻醉方式35
   */
  c43x35c?: string;

  /**
   * 其他手术操作麻醉医师35
   */
  c44x35?: string;

  /**
   * 其他手术操作编码36
   */
  c35x36c?: string;

  /**
   * 其他手术操作名称36
   */
  c36x36n?: string;

  /**
   * 其他手术操作日期36
   */
  c37x36?: string;

  /**
   * 其他手术操作级别36
   */
  c38x36?: string;

  /**
   * 其他手术操作术者36
   */
  c39x36?: string;

  /**
   * 其他手术操作Ⅰ助36
   */
  c40x36?: string;

  /**
   * 其他手术操作Ⅱ助36
   */
  c41x36?: string;

  /**
   * 其他手术操作切口愈合等级36
   */
  c42x36c?: string;

  /**
   * 其他手术操作麻醉方式36
   */
  c43x36c?: string;

  /**
   * 其他手术操作麻醉医师36
   */
  c44x36?: string;

  /**
   * 其他手术操作编码37
   */
  c35x37c?: string;

  /**
   * 其他手术操作名称37
   */
  c36x37n?: string;

  /**
   * 其他手术操作日期37
   */
  c37x37?: string;

  /**
   * 其他手术操作级别37
   */
  c38x37?: string;

  /**
   * 其他手术操作术者37
   */
  c39x37?: string;

  /**
   * 其他手术操作Ⅰ助37
   */
  c40x37?: string;

  /**
   * 其他手术操作Ⅱ助37
   */
  c41x37?: string;

  /**
   * 其他手术操作切口愈合等级37
   */
  c42x37c?: string;

  /**
   * 其他手术操作麻醉方式37
   */
  c43x37c?: string;

  /**
   * 其他手术操作麻醉医师37
   */
  c44x37?: string;

  /**
   * 其他手术操作编码38
   */
  c35x38c?: string;

  /**
   * 其他手术操作名称38
   */
  c36x38n?: string;

  /**
   * 其他手术操作日期38
   */
  c37x38?: string;

  /**
   * 其他手术操作级别38
   */
  c38x38?: string;

  /**
   * 其他手术操作术者38
   */
  c39x38?: string;

  /**
   * 其他手术操作Ⅰ助38
   */
  c40x38?: string;

  /**
   * 其他手术操作Ⅱ助38
   */
  c41x38?: string;

  /**
   * 其他手术操作切口愈合等级38
   */
  c42x38c?: string;

  /**
   * 其他手术操作麻醉方式38
   */
  c43x38c?: string;

  /**
   * 其他手术操作麻醉医师38
   */
  c44x38?: string;

  /**
   * 其他手术操作编码39
   */
  c35x39c?: string;

  /**
   * 其他手术操作名称39
   */
  c36x39n?: string;

  /**
   * 其他手术操作日期39
   */
  c37x39?: string;

  /**
   * 其他手术操作级别39
   */
  c38x39?: string;

  /**
   * 其他手术操作术者39
   */
  c39x39?: string;

  /**
   * 其他手术操作Ⅰ助39
   */
  c40x39?: string;

  /**
   * 其他手术操作Ⅱ助39
   */
  c41x39?: string;

  /**
   * 其他手术操作切口愈合等级39
   */
  c42x39c?: string;

  /**
   * 其他手术操作麻醉方式39
   */
  c43x39c?: string;

  /**
   * 其他手术操作麻醉医师39
   */
  c44x39?: string;

  /**
   * 其他手术操作编码40
   */
  c35x40c?: string;

  /**
   * 其他手术操作名称40
   */
  c36x40n?: string;

  /**
   * 其他手术操作日期40
   */
  c37x40?: string;

  /**
   * 其他手术操作级别40
   */
  c38x40?: string;

  /**
   * 其他手术操作术者40
   */
  c39x40?: string;

  /**
   * 其他手术操作Ⅰ助40
   */
  c40x40?: string;

  /**
   * 其他手术操作Ⅱ助40
   */
  c41x40?: string;

  /**
   * 其他手术操作切口愈合等级40
   */
  c42x40c?: string;

  /**
   * 其他手术操作麻醉方式40
   */
  c43x40c?: string;

  /**
   * 其他手术操作麻醉医师40
   */
  c44x40?: string;

  /**
   * 住院总费用
   */
  d01?: number;

  /**
   * 住院总费用其中自付金额
   */
  d09?: number;

  /**
   * 1.一般医疗服务费
   */
  d11?: number;

  /**
   * 2.一般治疗操作费
   */
  d12?: number;

  /**
   * 3.护理费
   */
  d13?: number;

  /**
   * 4.综合医疗服务类其他费用
   */
  d14?: number;

  /**
   * 5.病理诊断费
   */
  d15?: number;

  /**
   * 6.实验室诊断费
   */
  d16?: number;

  /**
   * 7.影像学诊断费
   */
  d17?: number;

  /**
   * 8.临床诊断项目费
   */
  d18?: number;

  /**
   * 9.非手术治疗项目费
   */
  d19?: number;

  /**
   * 其中:临床物理治疗费
   */
  d19x01?: number;

  /**
   * 10.手术治疗费
   */
  d20?: number;

  /**
   * 其中:麻醉费
   */
  d20x01?: number;

  /**
   * 其中:手术费
   */
  d20x02?: number;

  /**
   * 11.康复费
   */
  d21?: number;

  /**
   * 12.中医治疗费
   */
  d22?: number;

  /**
   * 13.西药费
   */
  d23?: number;

  /**
   * 其中:抗菌药物费
   */
  d23x01?: number;

  /**
   * 14.中成药费
   */
  d24?: number;

  /**
   * 15.中草药费
   */
  d25?: number;

  /**
   * 16.血费
   */
  d26?: number;

  /**
   * 17.白蛋白类制品费
   */
  d27?: number;

  /**
   * 18.球蛋白类制品费
   */
  d28?: number;

  /**
   * 19.凝血因子类制品费
   */
  d29?: number;

  /**
   * 20.细胞因子类制品费
   */
  d30?: number;

  /**
   * 21.检查用一次性医用材料费
   */
  d31?: number;

  /**
   * 22.治疗用一次性医用材料费
   */
  d32?: number;

  /**
   * 23.手术用一次性医用材料费
   */
  d33?: number;

  /**
   * 24.其他费
   */
  d34?: number;

  /**
   * 扩展字段1-预留
   */
  e01?: string;

  /**
   * 扩展字段2-预留
   */
  e02?: string;

  /**
   * 扩展字段3-预留
   */
  e03?: string;

  /**
   * 扩展字段4-预留
   */
  e04?: string;

  /**
   * 扩展字段5-预留时间
   */
  e05?: string;

  /**
   * 扩展字段6-预留金额
   */
  e06?: number;

  /**
   * 扩展字段7-预留数字
   */
  e07?: number;

  /**
   * 扩展字段8-预留文本
   */
  e08?: string;

  /**
   * 扩展字段9-预留布尔值
   */
  e09?: number;

  /**
   * 扩展字段10-预留编码
   */
  e10?: string;

  /**
   * 日期范围参数
   */
  params?: any;
}



